[
  {
    "name": "Artisan",
    "startingCredits": 1500,
    "mechanics": [
      {
        "type": "skill",
        "value": "insight"
      },
      {
        "type": "skill",
        "value": "persuasion"
      },
      {
        "type": "model-choice",
        "model": "subgrounds",
        "label": "Choose a trade",
        "options": true,
        "limits": [
          {
            "attr": "id",
            "value": [
              "BG_armorsmith",
              "BG_brewer",
              "BG_chemist",
              "BG_cook",
              "BG_mechanic",
              "BG_painter",
              "BG_tailor",
              "BG_weaponsmith"
            ]
          }
        ]
      }
    ],
    "html": "<p><strong>Skill Proficiencies</strong>. Insight, Persuasion</p>\n<p><strong>Tool Proficiencies</strong>. One artisan tool based on your trade (see table below)</p>\n<p><strong>Equipment</strong>. A set of artisan's tools based on your trade and 1,500 credits</p>\n<p><strong>Feature: Renowned Among Peers</strong>. As an established artisan of your craft, you can rely on certain benefits. Fellow practitioners\nof your trade know of you and will provide you with lodging and food if necessary. When in larger cities, you can always\nfind and are welcome in trade shows and can usually find deep discounts for offering nothing but your wisdom to up-and-coming\nartisans of your trade. As long as you remain in a city, you can easily find work, providing up to 500 credits a day.</p>\n<p><strong>Trade</strong>. Each artisan has special skills in a trade. Choose the trade, or roll on the table below.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>d8</th>\n<th>Trade</th>\n<th>Artisan Tool</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Armorsmith</td>\n<td>Armorsmith's Workbench</td>\n</tr>\n<tr>\n<td>2</td>\n<td>Brewer</td>\n<td>Brewer's Supplies</td>\n</tr>\n<tr>\n<td>3</td>\n<td>Chemist</td>\n<td>Chemist's Supplies</td>\n</tr>\n<tr>\n<td>4</td>\n<td>Cook</td>\n<td>Cook's Utensils</td>\n</tr>\n<tr>\n<td>5</td>\n<td>Mechanic</td>\n<td>Tinker's Tools or starship system (power core)</td>\n</tr>\n<tr>\n<td>6</td>\n<td>Painter</td>\n<td>Painter's Supplies</td>\n</tr>\n<tr>\n<td>7</td>\n<td>Tailor</td>\n<td>Tailor's Tools</td>\n</tr>\n<tr>\n<td>8</td>\n<td>Weaponsmith</td>\n<td>Weaponsmith's Workbench</td>\n</tr>\n</tbody>\n</template></v-simple-table><div class=\"hr\"></div>\n<h3>Suggested Characteristics</h3>\n<p>Use the Guild Artisan / Guild Merchant background's suggested characteristics in the D&amp;D Player's Handbook, pg. 132-133</p>\n",
    "id": "artisan"
  },
  {
    "name": "Bureaucrat",
    "startingCredits": 5000,
    "mechanics": [
      {
        "type": "skill",
        "value": "history"
      },
      {
        "type": "skill-choice",
        "options": true,
        "limit": [
          "deception",
          "investigation",
          "insight",
          "perception",
          "persuasion"
        ]
      }
    ],
    "html": "<p><em>text based on <a href=\"https://www.dndbeyond.com/characters/backgrounds/2108-bureaucrat\" target=\"_blank\">homebrew background by fromshus</a></em></p>\n<p><strong>Skill Proficiencies</strong>. History, and one of either Deception, Investigation, Insight, Perception or Persuasion.</p>\n<p><strong>Equipment</strong>. A collection of fine outfits for professional and formal settings and 5,000 credits</p>\n<h3>Choose one of the following features</h3>\n<p><strong>Feature: Political Connections</strong>. Your knowledge of how bureaucracies function lets you gain access to the records and inner\nworkings of almost any government you encounter (so long as the government is allied with your own). You know who the\nmovers and shakers are, whom to go to for the favors you seek.</p>\n<p><strong>Alternate Feature: Detail Oriented</strong>. You are precise, efficient and organized. By habit, you keep careful notes and are able to\nkeep track of many different pieces of information, and you can recall details that others may have forgotten.\nIn addition, you are a well of esoteric information, gaining Advantage on Intelligence (History) checks directly\nrelated to your area of expertise.</p>\n<p><strong>Area of Expertise</strong>. Civilizations depend on an extensive bureaucracy to manage their affairs. Some bureaucrats are more\nspecialized than others, but you likely worked in one of a few important fields. Choose the field that you worked in as\na bureaucrat, or roll on the table below.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>d6</th>\n<th>Area of Expertise</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Finance/Trade/Taxation</td>\n</tr>\n<tr>\n<td>2</td>\n<td>Civil/Military Engineering</td>\n</tr>\n<tr>\n<td>3</td>\n<td>Civil/Criminal Law</td>\n</tr>\n<tr>\n<td>4</td>\n<td>Census and Archives</td>\n</tr>\n<tr>\n<td>5</td>\n<td>Diplomacy, Intergalactic Law</td>\n</tr>\n<tr>\n<td>6</td>\n<td>Military Administration/Logistics</td>\n</tr>\n</tbody>\n</template></v-simple-table><div class=\"hr\"></div>\n<h3>Suggested Characteristics</h3>\n<p>Bureaucrats are practical, sometimes to a fault, and are often viewed as boring and officious. They are generally intelligent\nand tend toward order and lawfulness, though there are always exceptions.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>d8</th>\n<th>Personality Trait</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Hygiene is more important than most people realize. I hate getting dirty and don't like dirty people.</td>\n</tr>\n<tr>\n<td>2</td>\n<td>I hoard information and have more books, journal subscriptions and star maps than is strictly necessary.</td>\n</tr>\n<tr>\n<td>3</td>\n<td>I often correct others' grammar or choice of words when they speak.</td>\n</tr>\n<tr>\n<td>4</td>\n<td>I don't speak very much, but I am always listening.</td>\n</tr>\n<tr>\n<td>5</td>\n<td>I can speak at length on certain topics and jump at any chance to do so.</td>\n</tr>\n<tr>\n<td>6</td>\n<td>It takes a lot of mental energy to be as organized as I am and I resent those who don't appreciate that.</td>\n</tr>\n<tr>\n<td>7</td>\n<td>I am always eager to solve a puzzle and get bored if I'm not challenged intellectually.</td>\n</tr>\n<tr>\n<td>8</td>\n<td>I keep a journal in which, among other things, I record slights against me and my negative thoughts about others.</td>\n</tr>\n</tbody>\n</template></v-simple-table><br>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>d6</th>\n<th>Ideal</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>Order: The world is in harmony when things are put to their proper use and in their proper place. (Lawful)</td>\n</tr>\n<tr>\n<td>2</td>\n<td>Knowledge: Reliable information and education are the keys to prosperity. (Good)</td>\n</tr>\n<tr>\n<td>3</td>\n<td>Remembrance: The future is uncertain, but by keeping records of history we can avoid the mistakes of the past. (Neutral)</td>\n</tr>\n<tr>\n<td>4</td>\n<td>Opportunism: There are always loopholes in any system, no matter how complex, and the challenge is to find them. (Chaotic)</td>\n</tr>\n<tr>\n<td>5</td>\n<td>Oppression: Laws are a tool and they must be ruthlessly enforced to keep the herd in check. (Evil)</td>\n</tr>\n<tr>\n<td>6</td>\n<td>Connections: Being connected is the best way to get ahead in life. (Any)</td>\n</tr>\n</tbody>\n</template></v-simple-table><br>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>d6</th>\n<th>Bond</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>I am an envoy on a special mission for my employer.</td>\n</tr>\n<tr>\n<td>2</td>\n<td>I am in possession of a potentially damning secret regarding the illegal activities of a powerful person.</td>\n</tr>\n<tr>\n<td>3</td>\n<td>I care more about finding the truth above all other things. Transparency is my highest priority.</td>\n</tr>\n<tr>\n<td>4</td>\n<td>The law does not necessarily mean justice. I oppose those who use the law to extract anything but justice.</td>\n</tr>\n<tr>\n<td>5</td>\n<td>I seek to help those in need by teaching law, literacy, and good management.</td>\n</tr>\n<tr>\n<td>6</td>\n<td>I may not be from a well-known lineage of my species, but with my knowledge of governance, I can become a powerful leader.</td>\n</tr>\n</tbody>\n</template></v-simple-table><br>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>d6</th>\n<th>Flaw</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>I am a creature of habit and get very anxious when my routine is interrupted.</td>\n</tr>\n<tr>\n<td>2</td>\n<td>I am more disorganized than I like to admit and often lose track of my things.</td>\n</tr>\n<tr>\n<td>3</td>\n<td>I have an obsessive habit that others find strange, amusing or irritating.</td>\n</tr>\n<tr>\n<td>4</td>\n<td>I tend to overthink everything and make situations more complex than they need to be.</td>\n</tr>\n<tr>\n<td>5</td>\n<td>I dislike ambiguity and have trouble making decisions if there are no clear rules to guide me.</td>\n</tr>\n<tr>\n<td>6</td>\n<td>I adhere to the letter of the law even if it is illogical to do so.</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "bureaucrat"
  }
]