[
  {
    "name": "Berserker",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/berserker_01.png",
    "snippet": "People of towns and cities take pride in how their civilized ways set them apart from animals, as if denying one's own nature was a mark of superiority",
    "primaryAbility": [
      "str"
    ],
    "hitDie": 12,
    "profs": {
      "armor": {
        "text": "Light armor, medium armor",
        "has": [
          "light_armor",
          "medium_armor"
        ]
      },
      "weapon": {
        "text": "All vibroweapons, simple blasters",
        "has": [
          "all_vibroweapons",
          "simple_blasters"
        ]
      },
      "tool": false,
      "skill": {
        "text": "Choose two from Animal Handling,Athletics,Intimidation,Nature,Perception,Survival",
        "choices": {
          "items": [
            "animal handling",
            "athletics",
            "intimidation",
            "nature",
            "perception",
            "survival"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Strength, Constitution",
        "has": [
          "str",
          "con"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) a vibroweapon and a light or medium physical shield or (b) two vibroweapons"
      },
      {
        "text": "(a) two techaxes or (b) two vibrospears"
      },
      {
        "text": "(a) a dungeoneer's pack or (b) an explorer's pack"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Berserker Approaches",
    "progression": {
      "subclass": [
        2,
        6,
        10,
        14
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ]
    },
    "html": "<p>A massive wookiee hunter prowls through the forest, hefting his vibroaxe. With a roar he charges at the pair of trandoshans who dared poach his kin.</p>\n<p>A gamorrean snarls at the latest challenger to his authority over their savage tribe, ready to break his neck with his bare hands as he did to the last six rivals.</p>\n<p>Frothing at the mouth, a nikto slams his helmet into the face of his foe, then turns to drive his armored elbow into the gut of another.</p>\n<p>These berserkers, different as they might be, are defined by their rage: unbridled, unquenchable, and unthinking fury. More than a mere emotion, their anger is the ferocity of a cornered predator, the unrelenting assault of a storm, the churning turmoil of the sea. For every berserker, rage is a power that fuels not just a battle frenzy but also uncanny reflexes, resilience, and feats of strength.</p>\n<me-tpg e=\"div\" s=\"h3\">Primal Instinct</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>People of towns and cities take pride in how their civilized ways set them apart from animals, as if denying one's own nature was a mark of superiority. To a berserker, though, civilization is no virtue, but a sign of weakness. The strong embrace their animal nature keen instincts, primal physicality, and ferocious rage. Berserkers are uncomfortable when hedged in by walls and crowds. They thrive where the civilized don't.</p>\n<p>Berserkers come alive in the chaos of combat. They can enter a berserk state where rage takes over, giving them superhuman strength and resilience. A berserker can draw on this reservoir of fury only a few times without resting, but those few rages are usually sufficient to defeat whatever threats arise.</p>\n<me-tpg e=\"div\" s=\"h3\">A Life of Danger</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Not every person deemed &quot;berserkers&quot; by scions of civilized society has the berserker class. A true berserker among these people is as uncommon as a skilled fighter in a town, and he or she plays a similar role as a protector of the people and a leader in times of war. Life in the wild places of the world is fraught with peril: rival tribes, deadly weather, and terrifying monsters. Berserkers charge headlong into that danger so that their people don't have to.</p>\n<p>Their courage in the face of danger makes berserkers perfectly suited for adventuring. Wandering is often a way of life for their native tribes, and the rootless life of the adventurer is little hardship for a berserker. Some berserkers miss the close-knit family structures of the tribe, but eventually find them replaced by the bonds formed among the members of their adventuring parties.</p>\n",
    "id": "berserker"
  },
  {
    "name": "Consular",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/consular_01.png",
    "snippet": "Refraining from drawing their lightsabers except as a measure of last resort, consulars spend a great deal of time studying the mysteries of the Force",
    "primaryAbility": [
      "wis",
      "cha"
    ],
    "hitDie": 6,
    "profs": {
      "armor": false,
      "weapon": {
        "text": "Simple lightweapons, simple vibroweapons",
        "has": [
          "simple_lightweapon",
          "simple_vibroweapon"
        ]
      },
      "tool": false,
      "skill": {
        "text": "Choose two from Deception, Insight, Intimidation, Investigation, Lore, Medicine, and Persuasion",
        "choices": {
          "items": [
            "deception",
            "insight",
            "intimidation",
            "investigation",
            "lore",
            "medicine",
            "persuasion"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Charisma, Wisdom",
        "has": [
          "cha",
          "wis"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) a simple lightweapon or (b) a simple vibroweapon"
      },
      {
        "text": "(a) a scholar’s pack, (b) an explorer’s pack, or (c) a diplomat’s pack"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Consular Tradition",
    "progression": {
      "subclass": [
        2,
        6,
        10,
        14
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ]
    },
    "html": "<p>A Twi’lek in black robes steps on a terrified rodian, who scampers away on the ground. Lightning sparks from his\nfingers, illuminating his red and black tattoos. The rodian’s pleas for mercy fall on deaf ears as the Sith channels\nhis lightning into his failed apprentice, leaving nothing but a charred husk behind.</p>\n<p>Sitting cross-legged on a dense patch of grass, a miraluka mystic meditates on the Force. With every breath, the trees\nsway with a rhythmic breeze. Though she lacks simple vision, she can see the Force as it moves everything around her.</p>\n<p>A drably-robed human focuses inward, channeling the Force into the ground around him. Slowly, all the debris within\narms reach rises into the air around him; with a flick of his wrist, he clears the air, sending his projectiles to\npound on the approaching tank.</p>\n<p>Consulars are the supreme wielders of the Force, defined and united by the powers they cast. Drawing on the omnipresent\nForce that permeates the universe, consulars cast powers of rejuvenating healing and destructive lightning, draining\nlife-force and manipulating minds; the most powerful with the Force can even experience brief glimpses of the future.</p>\n<me-tpg e=\"div\" s=\"h3\">Strong with the force</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Refraining from drawing their lightsabers except as a measure of last resort, consulars spend a great deal of time\nstudying the mysteries of the Force. Their knowledge allows them to channel the Force to greater heights, unlocking\nunrivaled power, and twisting those powers to greater effect.</p>\n<me-tpg e=\"div\" s=\"h3\">Sage or Sorcerer</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Consulars who follow the light side of the Force, using their powers to better their communities and people, are often\ncalled sages, while consulars who fall to the dark side and subjugate or cast aside all in their path are commonly\ncalled sorcerers. Alternatively, they may tend toward the middle, refraining from politics and war, spending their\ntime in isolation and study.</p>\n<p>While creating your consular, consider your personal philosophy in regards to the Force and its most famous\npractitioners - the Jedi and the Sith. Are you a member of one of the two orders, or do you walk a different path?\nPerhaps you were ostracized from your primitive village out of superstition or jealousy. You may have been brutally\ntrained from a young age in the dark side, fueling your innate thirst for power, or perhaps you were trained as a\npadawan in one of the Jedi temples. How do you treat strangers, and how do they treat you once they know your abilities?\nWhat was your family like, or what did you have instead of a family? Do you see the Force as light and dark, or an\nimpartial river of gray?</p>\n<me-tpg e=\"div\" s=\"h4\">Quick Build</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>You can make a consular quickly by following these suggestions. First, make Wisdom or Charisma your highest\nability score, followed by Dexterity. Second, choose the Jedi or Sith background.</p>\n",
    "id": "consular"
  },
  {
    "name": "Engineer",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/engineer_01.png",
    "snippet": "While perhaps not as intimidating as a heavily-armored trooper, or as exotic as a lighsaber-wielding guardian, engineers are no less vital to group dynamic",
    "primaryAbility": [
      "int"
    ],
    "hitDie": 8,
    "profs": {
      "armor": {
        "text": "Light armor",
        "has": [
          "light"
        ]
      },
      "weapon": {
        "text": "Simple blasters, simple vibroweapons",
        "has": [
          "simple_blaster",
          "simple_vibroweapon"
        ]
      },
      "tool": {
        "choices": {
          "items": [
            "armorsmiths-workbench",
            "tailors-tools",
            "tinkers-tools",
            "weaponsmiths-workbench"
          ],
          "count": 1
        },
        "text": "Tinker's implements,one of your choice",
        "has": [
          "tinkers-tools"
        ]
      },
      "skill": {
        "text": "Choose two from Investigation, Lore, Medicine, Nature, Piloting, Technology",
        "choices": {
          "items": [
            "investigation",
            "lore",
            "medicine",
            "nature",
            "piloting",
            "technology"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Constitution, Intelligence",
        "has": [
          "con",
          "int"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) a simple vibroweapon or (b) a simple blaster and two power cells"
      },
      {
        "text": "(a) a dungeoneer's pack or (b) an explorer's pack"
      },
      {
        "text": "A combat suit"
      },
      {
        "text": "a set of tinker's implements"
      },
      {
        "text": "a vibrodagger"
      },
      {
        "text": "and a wristpad"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Engineering Disciplines",
    "progression": {
      "subclass": [
        3,
        6,
        14,
        16
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ],
      "columns": [
        {
          "label": "features"
        },
        {
          "label": "tech_points",
          "values": [
            2,
            4,
            5,
            7,
            11,
            13,
            15,
            17,
            20,
            23,
            26,
            26,
            30,
            30,
            34,
            34,
            39,
            42,
            45,
            50
          ]
        },
        {
          "label": "tech_point_limit",
          "values": [
            1,
            1,
            1,
            1,
            2,
            2,
            2,
            2,
            3,
            3,
            3,
            3,
            4,
            4,
            4,
            4,
            5,
            5,
            6,
            6
          ]
        }
      ]
    },
    "html": "<p>Flinching occasionally as a blaster bolt hits the nearby bulkhead, a Sullustan mechanic quickly solders a large wire. He peers through his tinted goggles, ignoring the shouts of his ship captain as the enemy descends on the hanger. Finally he shouts with pride as the repaired coupling powers up, causing the frigate to hum with energy. He gathers his tools and runs into the ship moments before it finally takes off.</p>\n<p>Inside, the human captain jumps into the cockpit. She nods to her droid co-pilot, who quickly begins charting a course home. Before the calculations can be completed, enemy Starfighters scream in from the clouds. The pilot rolls the ship, nimbly evading incoming fire. She reroutes the power to shields, leaving just enough for astronavigation. Just as the energy reserves near depletion, the exosphere and stars beyond blur into streaks of light. In a flash, they warp to safety.</p>\n<p>A Cerean officer surveys the battlefield, looking for weaknesses. When he identifies a potential problem, he keys in a quick combination in his wristpad. In a blink, a custom suit of armor assembles itself around him. As the helmet locks into place, the officer leaps into the air, flying overhead and raining destruction on the opposition.</p>\n<p>Every machine needs an engineer to run it, and a living crew is no different. Engineers are the experts and professionals who rely on skill, bravery, and their tools to survive and keep others alive. While they do not claim to be fighters, their mere presence can turn the tide of battle or simply keep operations running.</p>\n<me-tpg e=\"div\" s=\"h3\">Behind the Curtain</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>While perhaps not as intimidating as a heavily-armored trooper, or as exotic as a lighsaber-wielding guardian, engineers are no less vital to group dynamic. They are armorers and gunsmiths, electricians and welders, or any other facet to be found in facilities across the galaxy. Their work, often unsung, is what keeps starships (and their crew) intact.</p>\n<me-tpg e=\"div\" s=\"h3\">Unflappable</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>It takes bravery for a soldier to enter a battlefield. It perhaps takes more for someone who is unarmed, and untrained in combat, to do the same. Engineers put their lives on the line for a living, whether by choice or acknowledging their plights as an occupational hazard. Whether they come from an elite training academy or learned their talents surviving in the slums, they are no strangers to danger and conflict.</p>\n",
    "id": "engineer"
  },
  {
    "name": "Fighter",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/fighter_01.png",
    "snippet": "Versatile combatant who excels at both range and in melee",
    "primaryAbility": [
      "str",
      "dex"
    ],
    "hitDie": 10,
    "profs": {
      "armor": {
        "text": "All armor",
        "has": [
          "light",
          "medium",
          "heavy"
        ]
      },
      "weapon": {
        "text": "All blasters, all vibroweapons",
        "has": [
          "simple_blaster",
          "simple_vibroweapon",
          "martial_blaster",
          "martial_vibroweapon"
        ]
      },
      "tool": false,
      "skill": {
        "text": "Choose two from Acrobatics,Animal Handling,Athletics,Lore,Insight,Intimidation,Perception,Survival",
        "choices": {
          "items": [
            "acrobatics",
            "animal_handling",
            "athletics",
            "lore",
            "insight",
            "intimidation",
            "perception",
            "survival"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Strength, Constitution",
        "has": [
          "str",
          "con"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) mesh armor or (b) a combat suit,"
      },
      {
        "text": "blaster rifle or simple blaster"
      },
      {
        "text": "and two power cells"
      },
      {
        "text": "(a) a vibroweapon or heavy pistol and a light or medium physical shield or (b) two vibroweapons"
      },
      {
        "text": "(a) a light pistol and a power cell or (b) two vibrodaggers"
      },
      {
        "text": "(a) a dungeoneer's pack or (b) an explorer's pack"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Fighter Specialties",
    "progression": {
      "subclass": [
        3,
        7,
        10,
        15,
        18
      ],
      "abi": [
        4,
        6,
        8,
        12,
        14,
        16,
        19
      ],
      "columns": [
        {
          "label": "features"
        },
        {
          "label": "maneuvers_known",
          "values": [
            0,
            1,
            2,
            2,
            4,
            4,
            5,
            5,
            6,
            6,
            7,
            7,
            9,
            9,
            10,
            10,
            11,
            11,
            12,
            12
          ]
        },
        {
          "label": "superiority_dice_quantity",
          "values": [
            0,
            2,
            2,
            2,
            3,
            3,
            3,
            3,
            4,
            4,
            4,
            4,
            5,
            5,
            5,
            5,
            6,
            6,
            6,
            6
          ]
        },
        {
          "label": "superiority_dice_size",
          "values": [
            1,
            1,
            1,
            2,
            2,
            2,
            2,
            3,
            3,
            3,
            3,
            4,
            4,
            4,
            5,
            5,
            5,
            6,
            6,
            6
          ]
        },
        {
          "label": "strategies_known",
          "values": [
            0,
            0,
            1,
            1,
            1,
            1,
            2,
            2,
            2,
            2,
            2,
            2,
            3,
            3,
            3,
            3,
            4,
            4,
            4,
            4
          ]
        }
      ]
    },
    "html": "<p>A Trandoshan runs frantically across rooftops, constantly looking over his shoulder. As he prepares to leap a gap, a blaster bolt hits him in the back and renders him unconscious. His blurry vision barely makes out the figure of a masked woman who casually approaches, ready to collect her bounty.</p>\n<p>With his muscular arms held wide, a grizzled-looking Wookiee grins to his bloodthirsty crowd. He turns back to his arena opponent just in time to see the Besalisk take a swing. He ducks, punching the four-armed fighter in the gut. Two wild haymakers later, and he stands alone as the gladiatorial champion.</p>\n<p>Taking a deep breath, a Republic soldier looks out onto the war zone waging across the frozen surface of Ilum. He grips his blaster rifle tightly then, with a nod to the dozen squad-mates beside him, he charges onto the battlefield.</p>\n<p>Fighters combine discipline with martial skills to become the best pure warriors in the galaxy. Fighters can be stalwart defenders of those in need, cruel marauders, or brave advent-urers. They fight for glory, honor, to right wrongs, to gain power, to acquire wealth, or simple for the thrill of battle.</p>\n<me-tpg e=\"div\" s=\"h3\">All in a Day's Work</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Many fighters see adventures, raids on enemy strongholds, and dangerous missions as their jobs. Some want to defend those who can't defend themselves while others seek to use their muscle to carve their own place of importance in the galaxy. Fighters can take the form of guards, champions, bounty hunters, enforcers, mercenaries, freedom fighters, or simply armed explorers.</p>\n<me-tpg e=\"div\" s=\"h3\">Code Red</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Most fighters come to the profession after receiving at least some amount of formal training from a military organization. Some attend formal academies; others are self-taught and well tested. A fighter may have taken up his weapon to escape a mundane life while another may be following a proud family tradition. Whatever their origins, most fighters share an unshakeable loyalty. Fighters follow orders with little hesitation, as failure can often mean death.</p>\n",
    "id": "fighter"
  },
  {
    "name": "Guardian",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/guardian_01.png",
    "snippet": "An unstoppable agent of the Force, the guardian channels the power flowing through him into his weapons",
    "primaryAbility": [
      "str"
    ],
    "hitDie": 10,
    "profs": {
      "armor": {
        "text": "Light armor, medium armor",
        "has": [
          "light",
          "medium"
        ]
      },
      "weapon": {
        "text": "All lightweapons, all vibroweapons",
        "has": [
          "simple_lightweapon",
          "martial_lightweapon",
          "martial_vibroweapon",
          "simple_vibroweapon"
        ]
      },
      "tool": false,
      "skill": {
        "text": "Choose two from Acrobatics,Athletics,Deception,Insight,Intimidation,Lore,Perception,Persuasion,Piloting",
        "choices": {
          "items": [
            "acrobatics",
            "athletics",
            "deception",
            "insight",
            "intimidation",
            "lore",
            "perception",
            "persuasion",
            "piloting"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Constitution, Charisma",
        "has": [
          "con",
          "cha"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) mesh armor"
      },
      {
        "text": "(b) a combat suit"
      },
      {
        "text": "and a light physical shield"
      },
      {
        "text": "(a) a lightweapon or vibroweapon and a light or medium physical shield or (b) two lightweapons or vibroweapons"
      },
      {
        "text": "(a) a priest's pack or (b) an explorer's pack"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Guardian Foci",
    "progression": {
      "subclass": [
        3,
        7,
        15,
        20
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ],
      "columns": [
        {
          "label": "features"
        },
        {
          "label": "barrier_uses",
          "values": [
            2,
            2,
            3,
            3,
            3,
            4,
            4,
            4,
            4,
            4,
            4,
            5,
            5,
            5,
            5,
            5,
            6,
            6,
            6,
            6
          ]
        },
        {
          "label": "barrier_ticks",
          "values": [
            3,
            3,
            3,
            4,
            4,
            4,
            5,
            5,
            5,
            6,
            6,
            6,
            7,
            7,
            7,
            8,
            8,
            9,
            9,
            10
          ]
        },
        {
          "label": "powers_known",
          "values": [
            5,
            7,
            9,
            10,
            12,
            13,
            14,
            15,
            17,
            18,
            19,
            20,
            22,
            23,
            24,
            25,
            27,
            28,
            29,
            30
          ]
        },
        {
          "label": "tech_points",
          "values": [
            2,
            4,
            6,
            8,
            10,
            12,
            14,
            16,
            18,
            20,
            22,
            24,
            26,
            28,
            30,
            32,
            34,
            36,
            38,
            40
          ]
        },
        {
          "label": "tech_point_limit",
          "values": [
            1,
            1,
            1,
            1,
            2,
            2,
            2,
            2,
            3,
            3,
            3,
            3,
            4,
            4,
            4,
            4,
            5,
            5,
            5,
            5
          ]
        }
      ]
    },
    "html": "<p>A dark-skinned human quickly runs down a corridor, the metal armor under his grey cloak clanking with each step. He rounds the corner into the prison while the lights and power are still out, urging the weakened prisoners to escape. Just then a handful of slavers arrive and ready their blasters. The man draws and ignites a white-bladed lightsaber, ready to die for the strangers behind him.</p>\n<p>A sith pureblood, clad head to toe in black and red armor, charges towards a line of soldiers. Shot after shot deflects off his armor until he reaches his prey, where he unleashes his fury in a series of devastating lightsaber sweeps.</p>\n<p>A zabrak general dramatically leaps to his soon-to-be overrun squad, landing with a flurry of lightsaber attacks. At the arrival of this powerful Jedi, the attackers fall back.</p>\n<p>Guardians are the master of the art of lightsaber combat. They focus on utilizing the everpresent power of the Force to enable devastating attacks, often single-handedly turning the tide of battle.</p>\n<me-tpg e=\"div\" s=\"h3\">Protector or Destroyer</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>An unstoppable agent of the Force, the guardian channels the power flowing through him into his weapons. Their skills with a lightsaber are unrivalled. Subduing their enemies and bolstering their allies, the guardian uses the Force to control what happens around them.</p>\n<me-tpg e=\"div\" s=\"h3\">Natural Leaders</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>The guardian's command of the Force lends them a powerful presence. Whether through fear and intimidation or respect and admiration, the guardian is one of the greatest generals on the battlefield. They are a symbol of power to their followers.</p>\n",
    "id": "guardian"
  },
  {
    "name": "Monk",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/monk_01.png",
    "snippet": "Monks make careful study of a mystical energy that most monastic orders call focus",
    "primaryAbility": [
      "dex"
    ],
    "hitDie": 8,
    "profs": {
      "armor": false,
      "weapon": {
        "text": "Simple blasters, simple vibroweapons, martial vibroweapons that lack the dexterity, heavy, special, and two-handed properties",
        "has": [
          "simple_blasters",
          "simple_vibroweapons",
          "martial_vibroweapons_that_lack_the_dexterity",
          "heavy",
          "special",
          "and_two-handed_properties"
        ]
      },
      "tool": false,
      "skill": {
        "text": "Choose two from Acrobatics,Athletics,Insight,Lore,Perception,Stealth",
        "choices": {
          "items": [
            "acrobatics",
            "athletics",
            "insight",
            "lore",
            "perception",
            "stealth"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Strength, Dexterity",
        "has": [
          "str",
          "dex"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) a vibroweapon with which you are proficient or (b) a simple blaster and a power cell"
      },
      {
        "text": "(a) a dungeoneer's pack or (b) an explorer's pack"
      },
      {
        "text": "10 vibrodarts"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Monastic Orders",
    "progression": {
      "subclass": [
        2,
        6,
        10,
        14
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ]
    },
    "html": "<p>Her vibrostaff a blur as they deflect an incoming hail of blaster bolts, a human springs over a barricade and throws herself into the massed ranks of pirates on the other side. She whirls among them, knocking their blows aside and sending them reeling, until at last she stands alone.</p>\n<p>Taking a deep breath, a zabrak covered in tattoos settles into a battle stance. As the first charging mercenaries reach him, he exhales and a blast of negative energy courses from his hands, engulfing his foes.</p>\n<p>Moving with the silence of the night, a black-clad mirialan steps into a shadow beneath an arch and nimbly climbs to the balcony a stone's throw above her. She slides her blade free of its cloth-wrapped scabbard and peers through the open window at the warlord, so vulnerable in the grip of sleep.</p>\n<p>Whatever their discipline, monks are united in their ability to harness the energy that flows in their bodies. Whether channeled as a striking display of combat prowess or a subtler focus of defensive ability and speed, this energy infuses all that a monk does.</p>\n<me-tpg e=\"div\" s=\"h3\">The Power of Focus</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Monks make careful study of a mystical energy that most monastic orders call focus. This energy is an element of the power that suffuses the galaxy�specifically, the element that flows through living bodies. Monks harness this energy within themselves to create powerful effects and exceed their bodies' physical capabilities, and some of their special attacks can hinder the flow of focus in their opponents. Using this energy, monks channel uncanny speed and strength into their unarmed strikes. As they gain experience, their martial training and their mastery of focus gives them more power over their bodies and the bodies of their foes.</p>\n<me-tpg e=\"div\" s=\"h3\">Training and Asceticism</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Most monks live entirely apart from the surrounding population, secluded from anything that might impede their spiritual progress. Others are sworn to isolation, emerging only to serve as spies or assassins at the command of their leader, a noble patron, or some other power.</p>\n<p>The majority of monks don't shun their neighbors, making frequent visits to nearby towns or villages and exchanging their service for food and other goods. As versatile warriors, monks often end up protecting their neighbors from monsters or brigands.</p>\n<p>For a monk, becoming an adventurer means leaving a structured, communal lifestyle to become a wanderer. This can be a harsh transition, and monks don't undertake it lightly. Those who leave their cloisters take their work seriously, approaching their adventures as personal tests of their physical and spiritual growth.</p>\n",
    "id": "monk"
  },
  {
    "name": "Operative",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/operative_01.png",
    "snippet": "Operatives have a knack for getting out of trouble",
    "primaryAbility": [
      "dex"
    ],
    "hitDie": 8,
    "profs": {
      "armor": {
        "text": "Light armor",
        "has": [
          "light_armor"
        ]
      },
      "weapon": {
        "text": "Simple blasters, simple vibroweapons, martial blasters that lack the auto, special, strength, and two-handed properties, martial vibroweapons with the finesse property",
        "has": [
          "simple_blasters",
          "simple_vibroweapons",
          "martial_blasters_that_lack_the_auto",
          "special",
          "strength",
          "and_two-handed_properties",
          "martial_vibroweapons_with_the_finesse_property"
        ]
      },
      "tool": {
        "text": "One specialist's kit of your choice",
        "has": [
          "one_specialist's_kit_of_your_choice"
        ]
      },
      "skill": {
        "text": "Choose two from Any",
        "choices": {
          "items": [
            "any"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Dexterity, Intelligence",
        "has": [
          "dex",
          "int"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) a vibroweapon with which you are proficient or (b) a simple blaster and a power cell"
      },
      {
        "text": "(a) a simple blaster and two power cells or (b) a simple vibroweapon and a light physical shield"
      },
      {
        "text": "(a) a burglar's pack"
      },
      {
        "text": "(b) a dungeoneer's pack"
      },
      {
        "text": "or (c) an explorer's pack"
      },
      {
        "text": "A tool with which you are proficient"
      },
      {
        "text": "A combat suit and a vibrodagger"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Operative Practices",
    "progression": {
      "subclass": [
        2,
        6,
        10,
        14
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ]
    },
    "html": "<p>A Bothan spy takes a moment to adjust her infrared goggles. Nimbly sidestepping the laser grid in the room, she slips to the computer at the far end. Counting down the seconds in her head, she slices the mainframe. Twenty seconds. Ten seconds. A handful of soldiers bursts into the room, but she is already gone � with the data in hand.</p>\n<p>With a wary eye on the door, a scruffy-looking Duros plays pazaak in a seedy cantina. When two city guards appear at the exit, he smiles and reaches under the table. Before they can move in, the smuggler flips the table and opens fire. The crowd scatters in panic, giving him just enough cover to escape.</p>\n<p>A gorgeous young human dances before an intoxicated senator in his parlor. She winks enticingly through her golden blonde hair as she sways closer. Leaning in for a kiss, the senator is instead surprised by the barrel of a hold-out blaster pistol shoved into his mouth. He has no time to shout before the assassin pulls the trigger.</p>\n<p>Operatives, whether good, bad, or neutral, are those who focus on a specific practice and utilize it to get the upper hand. They can come from any world or region in the galaxy, with origins from the lowliest scoundrel to the once social elite.</p>\n<me-tpg e=\"div\" s=\"h3\">Evading Danger</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Operatives have a knack for getting out of trouble. They have an instinct for self-preservation that keeps them alive, but it's usually tempered with a need to experience the thrills that their profession has to offer, and many adventurous operatives are also saddled with a sense of honor that sometimes makes them go against their natural inclinations. No matter what their immediate concerns may be, survival is the name of the game.</p>\n<me-tpg e=\"div\" s=\"h3\">Outside the Law</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Operatives don't often start out seeking to defy authority and break the law. Some are thrust into the profession as a means of rebellion. Others wind up on the wrong side of the law due to bad luck, poor decisions, or circumstances beyond their control. The skills they pick up along the way make them great members of any mission team.</p>\n",
    "id": "operative"
  },
  {
    "name": "Scholar",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/scholar_01.png",
    "snippet": "A true scholar is never satisfied",
    "primaryAbility": [
      "int"
    ],
    "hitDie": 8,
    "profs": {
      "armor": {
        "text": "Light armor",
        "has": [
          "light_armor"
        ]
      },
      "weapon": {
        "text": "Simple blasters, simple vibroweapons, martial vibroweapons with the finesse property",
        "has": [
          "simple_blasters",
          "simple_vibroweapons",
          "martial_vibroweapons_with_the_finesse_property"
        ]
      },
      "tool": {
        "text": "Any one",
        "has": [
          "any_one"
        ]
      },
      "skill": {
        "text": "Choose two from Deception,Insight,Intimidation,Investigation,Lore,Medicine,Nature,Persuasion,Survival",
        "choices": {
          "items": [
            "deception",
            "insight",
            "intimidation",
            "investigation",
            "lore",
            "medicine",
            "nature",
            "persuasion",
            "survival"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Intelligence, Wisdom",
        "has": [
          "int",
          "wis"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) a simple vibroweapon or (b) a simple blaster and two power cells"
      },
      {
        "text": "(a) a entertainer's pack"
      },
      {
        "text": "(b) an explorer's pack"
      },
      {
        "text": "or (c) a scholar's pack"
      },
      {
        "text": "A tool with which you are proficient"
      },
      {
        "text": "A combat suit"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Academic Pursuits",
    "progression": {
      "subclass": [
        2,
        6,
        10,
        14
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ]
    },
    "html": "<p>An overwhelming horde of tusken raiders bears down on a chiss and her fellow adventurers. She gives the order and her allies unleash a single coordinated attack cutting deep into their lines. Under her command the enemy is quickly routed against all odds, all according to plan.</p>\n<p>Deep within the once thought abandoned ruins, a nautolan tends to his companions wounds as they rest. Countless long nights of study and training have conditioned him to keep going even when all others have exhausted themselves. He will see them through this.</p>\n<p>A twi'lek in fine vestments addresses a gathering crowd. What was the making of an angry mob begins to disperse, his mere presence putting them at ease, giving his companions time to make their escape.</p>\n<p>Scholars are master of the mundane arts, using methodical practices to turn the tables to their advantage. From years of study and testing, scholars take in the situation around them and quickly formulate the means to achieve whatever they have minds set to. Whatever pursuit they follow, a scholar will have a plan for anything that comes their way.</p>\n<me-tpg e=\"div\" s=\"h3\">The Pursuit of Knowledge</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>A true scholar is never satisfied. They are always seeking out a new answer to a new question. This often goes hand-in-hand with seeking a life of adventure, to explore new, hidden areas, or accompany those that do. The life of a scholar often times begins in the mundane, as a teacher or sage. Sometimes they serve as doctors, diplomats, or as officers in the military.</p>\n<me-tpg e=\"div\" s=\"h3\">To Learn, To Know</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>For scholars, mundane life is often too slow. When life becomes stagnant or when an answer cannot be found, the call to adventure rings louder. Scholars will often go to ancient, forgotten, and often dangerous places to find something to quench their thirst for knowledge.</p>\n",
    "id": "scholar"
  },
  {
    "name": "Scout",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/scout_01.png",
    "snippet": "Warriors in their own right, scouts specialize in tracking and hunting the monsters that threaten civilization�humanoid raiders, rampaging beasts and monstrosities, terrible Force-wielders, and renegade droids",
    "primaryAbility": [
      "dex"
    ],
    "hitDie": 10,
    "profs": {
      "armor": {
        "text": "Light armor, medium armor",
        "has": [
          "light_armor",
          "medium_armor"
        ]
      },
      "weapon": {
        "text": "All blasters, all vibroweapons",
        "has": [
          "all_blasters",
          "all_vibroweapons"
        ]
      },
      "tool": false,
      "skill": {
        "text": "Choose two from Animal Handling,Athletics,Insight,Investigation,Perception,Piloting,Stealth,Survival,Technology",
        "choices": {
          "items": [
            "animal handling",
            "athletics",
            "insight",
            "investigation",
            "perception",
            "piloting",
            "stealth",
            "survival",
            "technology"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Strength, Dexterity",
        "has": [
          "str",
          "dex"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) mesh armor or (b) a combat suit"
      },
      {
        "text": "blaster rifle or simple blaster"
      },
      {
        "text": "and two power cells"
      },
      {
        "text": "(a) a vibroweapon and a light physical shield or (b) two simple vibroweapons"
      },
      {
        "text": "(a) a holdout and a power cell or (b) two vibrodaggers"
      },
      {
        "text": "(a) a dungeoneer's pack or (b) an explorer's pack"
      },
      {
        "text": "A wristpad"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Scout Techniques",
    "progression": {
      "subclass": [
        2,
        6,
        10,
        14
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ]
    },
    "html": "<p>Rough and grizzled looking, a human stalks alone through the shadows of trees, hunting the quarry he knows is planning a raid on a nearby settlement. Clutching a techblade in each hand, he becomes a whirlwind of steel, cutting down one enemy after another.</p>\n<p>After tumbling away from the shrapnel of a missile's explosion, a bothan finds her feet and quick-fires two shots from her carbine at the oncoming tank. Shrugging off the wave of fear that threatens to permeate her entire being, she strafes around her foe, firing shot after shot to try to penetrate the tank's thick armor.</p>\n<p>Glancing at his wristpad, a sullustan looks through the eyes of his tracker droid. Transmitting instructions, he sends his droid to distract the houk he's been tracking while he readies his sniper rifle for the shot.</p>\n<p>Scouts are the first on the trail and the last to lose it, tracking their quarry for miles unimpeded. They are adaptable, wielding both tech powers and their weaponry to overcome their foes.</p>\n<me-tpg e=\"div\" s=\"h3\">Deadly Hunters</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Warriors in their own right, scouts specialize in tracking and hunting the monsters that threaten civilization�humanoid raiders, rampaging beasts and monstrosities, terrible Force-wielders, and renegade droids. They learn to track their quarry as a predator does, moving stealthily through any terrain and hiding themselves in brush and rubble. Scouts focus their combat training on techniques that are particularly useful against their specific favored foes.</p>\n<p>Scouts acquire the ability to cast tech powers through utilization of a wristpad. Their powers, like their combat abilities, emphasize speed, stealth, and the hunt. A scout's talents and abilities are honed with deadly focus on the grim task of protecting the civilization.</p>\n<me-tpg e=\"div\" s=\"h3\">Independent Adventurers</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Though a scout might make a living as a bounty hunter, a guide, or a tracker, a scout's true calling is to defend civilization from the ravages of monsters and humanoid hordes that press in. In some places, scouts gather in secretive orders, though many scouts are independent almost to a fault, knowing that, when a rancor or a band of pirates attacks, a scout might be the first�and possibly the last�line of defense. This fierce independence makes scouts well suited to adventuring, since they are accustomed to life far from the comforts of a dry bed and a hot bath. Faced with city-bred adventurers who grouse and whine about the hardships of the wild, scouts respond with some mixture of amusement, frustration, and compassion. But they quickly learn that other adventurers who can carry their own weight in a fight against civilization's foes are worth any extra burden. Coddled city folk might not know how to feed themselves or find fresh water in the wild, but they make up for it in other ways.</p>\n",
    "id": "scout"
  },
  {
    "name": "Sentinel",
    "img": "https://starwars5ecentral.blob.core.windows.net/site-images/classes/sentinel_01.png",
    "snippet": "The sentinel uses stealth and subterfuge to accomplish the will of the Force",
    "primaryAbility": [
      "dex"
    ],
    "hitDie": 8,
    "profs": {
      "armor": {
        "text": "Light armor",
        "has": [
          "light_armor"
        ]
      },
      "weapon": {
        "text": "Simple lightweapons, simple vibroweapons, martial lightweapons with the finesse property, martial vibroweapons with the finesse property",
        "has": [
          "simple_lightweapons",
          "simple_vibroweapons",
          "martial_lightweapons_with_the_finesse_property",
          "martial_vibroweapons_with_the_finesse_property"
        ]
      },
      "tool": {
        "text": "One specialist's kit of your choice",
        "has": [
          "one_specialist's_kit_of_your_choice"
        ]
      },
      "skill": {
        "text": "Choose two from Acrobatics,Animal Handling,Insight,Intimidation,Perception,Persuasion,Piloting,Stealth,Technology",
        "choices": {
          "items": [
            "acrobatics",
            "animal handling",
            "insight",
            "intimidation",
            "perception",
            "persuasion",
            "piloting",
            "stealth",
            "technology"
          ],
          "count": 2
        }
      },
      "saving-throw": {
        "text": "Dexterity, Charisma",
        "has": [
          "dex",
          "cha"
        ]
      }
    },
    "startingEquipment": [
      {
        "text": "(a) two simple lightweapons or vibroweapons or (b) one lightweapon or vibroweapon with which you are proficient"
      },
      {
        "text": "(a) a dungeoneer's pack or (b) an explorer's pack"
      },
      {
        "text": "A specialist's kit with which you are proficient"
      },
      {
        "text": "A combat suit and a light physical shield"
      }
    ],
    "startingWealth": {
      "text": "In lieu of the equipment granted by your class and background, you can elect to purchase your starting gear. If you do so, you receive no equipment from your class and background, and instead roll for your starting wealth using the criteria below:",
      "value": "5d4"
    },
    "subclassLabel": "Sentinel Callings",
    "progression": {
      "subclass": [
        2,
        6,
        10,
        14
      ],
      "abi": [
        4,
        8,
        12,
        16,
        19
      ]
    },
    "html": "<p>Clad in black robes, the rattataki pulls his hood forward and steps into the shadowy alcove, only to reappear further down the hall. As his quarry walks past, he presses the hilt of his lightsaber to the back of their head, quickly toggling it on-and-off. He is gone before the corpse hits the ground.</p>\n<p>The togruta dashes across the battlefield, doublesaber deflecting blaster shots to the ground. She pulls her wounded padawan to her feet, and guides her away from the warzone.</p>\n<p>Green-bladed lightsaber a blur, the cathar ferociously presses the attack. With each strike, she guides her opponent closer to the ravine's edge. A flurry of blows followed by a quick <em>force push</em> and her foe tumbles over the edge.</p>\n<p>Sentinels are the masters of blending force powers with weapon attacks. They weave the two together so expertly that their foes have trouble predicting them.</p>\n<me-tpg e=\"div\" s=\"h3\">The Middle of the Road</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>The sentinel uses stealth and subterfuge to accomplish the will of the Force. Where the consular focuses on mastery of the Force and the guardian focuses on the mastery of the lightsaber, the sentinel focuses on merging the two.</p>\n<me-tpg e=\"div\" s=\"h3\">Solitary Action</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Sentinels are notoriously independent, most comfortable acting alone and without backup; where some use a team to make up for their weaknesses, the sentinel uses the Force to overcome theirs. While some take this independent streak to the extreme, they are usually accepting of authority, as long as they are allowed to carry out directions using their preferred methods.</p>\n",
    "id": "sentinel"
  }
]