[
  {
    "name": "Ambidextrous",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p>When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.</p>\n",
    "id": "ambidextrous"
  },
  {
    "name": "Area Style",
    "source": "PHB",
    "mechanics": [
      {
        "name": "Area Style",
        "moreInfo": {
          "model": "fighting-styles",
          "id": "area-style"
        },
        "type": "bonus-action",
        "shortDesc": "When a creature successfully saves against your projector canister, use your bonus action to force them to repeat the save"
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Area Style.</strong> You are skilled with weapons that affect an area. You gain the following benefits:</p>\n<ul>\n<li>When a creature successfully saves against your projector canister, you can use your bonus action to force them to repeat the save.</li>\n<li>When a creature rolls a 1 on the saving throw against a projector canister you control, they treat the effect's damage as if it had rolled the maximum.</li>\n</ul>\n",
    "id": "area-style"
  },
  {
    "name": "Assault",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "bf"
        },
        "augmentTypes": [
          "dc"
        ],
        "bonus": {
          "type": "flat",
          "value": 2
        }
      }
    ],
    "type": "fighting-styles",
    "html": "<p>When you make a Burst Fire attack, increase the DC by 2.</p>\n",
    "id": "assault"
  },
  {
    "name": "Assisting Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Assisting Style.</strong> You are skilled at enabling your allies. You gain the following benefits:</p>\n<ul>\n<li>You can take the Help action as a bonus action. If you could already take the Help action as a bonus action, you can instead take it as a reaction on your turn.</li>\n<li>Creatures benefiting from your Help action can't have disadvantage on the affected ability check or attack roll.</li>\n</ul>\n",
    "id": "assisting-style"
  },
  {
    "name": "Berserk Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "melee"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Berserk Style.</strong> You are skilled at returning pain to those who deliver it. You gain the following benefits:</p>\n<ul>\n<li>When you hit with a melee weapon attack using Strength, you deal additional damage equal to your Strength modifier if that creature dealt damage to you since the start of your last turn.</li>\n<li>When you choose to let an attack that would miss you hit you instead, the creature rolls the damage as normal instead of choosing the maximum.</li>\n</ul>\n",
    "id": "berserk-style"
  },
  {
    "name": "Blindfighting Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "sense",
        "sense": "blingsight",
        "distance": 10
      },
      {
        "name": "Double Blindsight",
        "moreInfo": {
          "model": "fighting-styles",
          "id": "blindfighting-style"
        },
        "type": "bonus-action"
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Blindfighting Style.</strong> You are skilled at fighting without sight. You gain the following benefits:</p>\n<ul>\n<li>You gain blindsight out to 10 feet. If you already have blindsight, it instead increases by 10 feet.</li>\n<li>You can use your bonus action to double the range of your blindsight until the start of your next turn.</li>\n</ul>\n",
    "id": "blindfighting-style"
  },
  {
    "name": "Brawler Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "natural-weapon",
        "replacesUnarmedStrike": true,
        "value": {
          "type": "natural-melee",
          "notes": [],
          "properties": [],
          "range": {
            "short": 5
          },
          "damage": {
            "dieCount": 1,
            "dieType": 4,
            "type": "bludgeoning"
          }
        }
      },
      {
        "name": "Brawler Style",
        "moreInfo": {
          "model": "fighting-styles",
          "id": "brawler-style"
        },
        "type": "bonus-action",
        "shortDesc": "When you attempt to grapple, shove, or trip a creature, or attack a creature with an  unarmed strike or a weapon wielded in one hand, you can use your bonus action to make an unarmed strike, grapple, shove, or trip against the same creature."
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Brawler Style.</strong> You are skilled at using your weight to your advantage. You gain the following benefits:</p>\n<ul>\n<li>You are proficient with improvised weapons.</li>\n<li>Your damage die for your unarmed strikes and natural weapons increases by one step (from 1 to d4, d4 to d6, or d6 to d8).</li>\n<li>When you take the Attack action and attempt to grapple, shove, or trip a creature, or make an attack against a creature with an unarmed strike or a weapon wielded in one hand on your turn, you can use your bonus action to make an unarmed strike, grapple, shove, or trip against the same creature.</li>\n</ul>\n",
    "id": "brawler-style"
  },
  {
    "name": "Brawler",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "type": "melee"
        },
        "augmentTypes": [
          "damage"
        ],
        "bonus": {
          "type": "proficiency"
        }
      }
    ],
    "type": "fighting-styles",
    "html": "<p>Add your proficiency bonus to your melee damage rolls.</p>\n",
    "id": "brawler"
  },
  {
    "name": "Carnage",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "modelTypes": [
            "shotgun"
          ]
        },
        "augmentTypes": [
          "damage"
        ],
        "rerollIfLessThan": 3
      }
    ],
    "type": "fighting-styles",
    "html": "<p>When you roll a 1 or 2 on a damage die for an attack you make with a shotgun, you can reroll the die and must use the new roll.</p>\n",
    "id": "carnage"
  },
  {
    "name": "Close-Quarters Shooter",
    "mechanics": [
      {
        "name": "Close-Quarters Shooter",
        "moreInfo": {
          "model": "edges",
          "id": "FS_close-quarters-shooter"
        },
        "type": "global-note",
        "subType": "action",
        "attack": "ranged",
        "value": "Close-Quarters Shooter"
      }
    ],
    "type": "fighting-styles",
    "html": "<p>When making a ranged attack while you are within <me-distance length=\"5\" /> of a hostile creature, you do not have\ndisadvantage on the attack roll. Your ranged attacks ignore half-cover against targets within <me-distance length=\"30\" /> of you.</p>\n",
    "id": "close-quarters-shooter"
  },
  {
    "name": "Counterstrike Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Counterstrike Style.</strong> You are skilled at returning attacks at those who dare strike you. You gain the following benefits:</p>\n<ul>\n<li>When you would provoke an opportunity attack on your turn, you can use your bonus action to force the creature to make the opportunity attack, if it can.</li>\n<li>Creatures who make opportunity attacks against you provoke opportunity attacks from you.</li>\n</ul>\n",
    "id": "counterstrike-style"
  },
  {
    "name": "Covert Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Covert Style.</strong> You are skilled at fighting from unseen angles. You gain the following benefits:</p>\n<ul>\n<li>You can take the Hide action as a bonus action. If you could already take the Hide action as a bonus action, you can instead take it as a reaction on your turn.</li>\n<li>Creatures you've dealt damage to since the start of your last turn have disadvantage on Wisdom (Perception) checks made to find you.</li>\n</ul>\n",
    "id": "covert-style"
  },
  {
    "name": "Defense Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Defense Style.</strong> You are skilled at the art of defending yourself. You gain the following benefits:</p>\n<ul>\n<li>While you are wearing medium or heavy armor with which you are proficient, you can use your bonus action to mark a target within 30 feet that you can see until the end of your next turn. When you do so, damage dealt to you by the target is reduced by an amount equal to half your Strength or Constitution modifier (your choice, minimum of one) while marked. If this would reduce the damage to 0, the damage is instead reduced to 1. You can only have one creature marked in this way at a time.</li>\n<li>You have advantage on Strength checks and Strength saving throws to avoid being moved.</li>\n</ul>\n",
    "id": "defense-style"
  },
  {
    "name": "Defense",
    "mechanics": [
      {
        "type": "ac",
        "bonus": {
          "type": "flat",
          "value": 1
        }
      }
    ],
    "type": "fighting-styles",
    "html": "<p>+1 AC.</p>\n",
    "id": "defense"
  },
  {
    "name": "Disruption Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Disruption Style.</strong> Choose one from force- or tech-casting. You are skilled at fighting and interfering with casters of the chosen type. You gain the following benefits:</p>\n<ul>\n<li>When you force a creature to make a Constitution saving throw to maintain concentration on your turn, and they succeed on the save, you can use your bonus action to force them to reroll the save. They must use the new roll.</li>\n<li>Once per round, when a hostile creature attempts to cast a power while within 5 feet of you, they must first make a Constitution saving throw as if to maintain concentration (DC = 10 + the power's level). On a failure, the power isn't cast and any points are wasted.</li>\n</ul>\n",
    "id": "disruption-style"
  },
  {
    "name": "Dual Wield Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Dual Wield Style.</strong> You are skilled at fighting with two weapons. You gain the following benefits:</p>\n<ul>\n<li>When you engage in Two-Weapon Fighting, you can add your ability modifier to the damage roll of your Two-Weapon Fighting attack as long as it doesn't already include that modifier.</li>\n<li>You can draw or stow two weapons when you would normally be able to draw or stow only one.</li>\n</ul>\n",
    "id": "dual-wield-style"
  },
  {
    "name": "Duelist Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Duelist Style.</strong> You are skilled in the art of fighting with a single weapon. You gain the following benefits:</p>\n<ul>\n<li>While you are wielding a weapon in one hand with which you are proficient and no other weapons, you can use your bonus action to feint. If you do so, you must make a Dexterity (Sleight of Hand) or Charisma (Deception) check (your choice) contested by the target's Wisdom (Insight) check. On a success, you have advantage on the first attack roll you make against them before the start of your next turn.</li>\n<li>While you are wielding a weapon in one hand with which you are proficient and no other weapons, when you miss with a weapon attack on your turn, you can use your bonus action to repeat the attack against the same target. Any modifications to the original attack roll, such as advantage, disadvantage, or without your proficiency bonus, also affect this attack roll.</li>\n<li>Once on each of your turns, drawing or stowing a one-handed weapon no longer requires your object interaction.</li>\n</ul>\n",
    "id": "duelist-style"
  },
  {
    "name": "Equilibrium Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Equilibrium Style.</strong> You are skilled at fighting without the confines of armor. You gain the following benefits:</p>\n<ul>\n<li>While you are wearing light or no armor and not wielding a shield, you can use your bonus action to mark a target within 30 feet that you can see until the end of your next turn. When you do so, you gain a bonus to AC and Dexterity saving throws against effects the target controls equal to half your Dexterity modifier (minimum of +1) while marked. You can only have one creature marked in this way at a time.</li>\n<li>You have advantage on Dexterity checks and Dexterity saving throws to avoid being moved.</li>\n</ul>\n",
    "id": "equilibrium-style"
  },
  {
    "name": "Explosives Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Explosives Style.</strong> You are skilled at fighting with explosives. You gain the following benefits:</p>\n<ul>\n<li>You can throw grenades and set mines with your bonus action, instead of your action. If you could already throw grenades and set mines as a bonus action, you can instead do so as a reaction on your turn.</li>\n<li>When a creature rolls a 1 on the saving throw against a grenade, mine, or missile you control, they treat the effect's damage as if it had rolled the maximum.</li>\n</ul>\n",
    "id": "explosives-style"
  },
  {
    "name": "Formation Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Formation Style.</strong> You are skilled at fighting with a partner. You gain the following benefits:</p>\n<ul>\n<li>You can take the Guard action as a bonus action. If you could already take the Guard action as a bonus action, you can instead take it as a reaction on your turn.</li>\n<li>When you move on your turn, you can use a bonus action to allow a willing ally within 5 feet of you to move with you (no action required by the ally). The ally must end this movement within 5 feet of you, and this movement can't exceed the ally's speed.</li>\n<li>When you choose to let an attack that would hit a guarded ally hit you instead, the creature rolls the damage as normal instead of choosing the maximum.</li>\n</ul>\n",
    "id": "formation-style"
  },
  {
    "name": "Formfighting Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Formfighting Style.</strong> <em><strong>Prerequisite:</strong> The ability to cast force powers</em>\nYou are skilled at the basics of the known forms of lightsaber combat. You gain the following benefits:</p>\n<ul>\n<li>You learn three lightsaber forms, detailed later in this chapter.</li>\n<li>Once on each of your turns, you can draw or stow a lightweapon without using your object interaction.</li>\n</ul>\n",
    "id": "formfighting-style"
  },
  {
    "name": "Great Weapon Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Great Weapon Style.</strong> You are skilled at putting the weight of a weapon to your advantage. You gain the following benefits:</p>\n<ul>\n<li>While you are wielding a two-handed light- or vibro-weapon with which you are proficient, your weapon damage rolls gain a minimum roll threshold, discussed in chapter 7.</li>\n<li>Grasping a two-handed weapon you are wielding in only one hand with your other hand no longer requires your object interaction.</li>\n</ul>\n",
    "id": "great-weapon-style"
  },
  {
    "name": "Guerrilla Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Guerrilla Style.</strong> You are skilled at maneuvering across the battlefield. You gain the following benefits:</p>\n<ul>\n<li>You can take the Disengage action as a bonus action. If you could already take the Disengage action as a bonus action, you can instead take it as a reaction on your turn.</li>\n<li>When you take the Disengage action, you ignore unenhanced difficult terrain, and you have advantage on the first ability check or saving throw to avoid an effect that impairs your movement speed or forces you to move before the start of your next turn.</li>\n</ul>\n",
    "id": "guerrilla-style"
  },
  {
    "name": "Gunning Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Gunning Style.</strong> You are skilled at using blasters in unique ways. You gain the following benefits:</p>\n<ul>\n<li>When a creature rolls a 1 on the saving throw against your burst or rapid property, they treat the effect's damage as if it had rolled the maximum.</li>\n<li>When you use the burst property of a weapon, you can instead spray a line 20 feet long and 5 feet wide within range with shots.</li>\n<li>When you use the rapid property of a weapon, when you roll the weapon's damage dice twice, you can double one set of the weapon's damage dice and forgo the other instead of adding them together.</li>\n</ul>\n",
    "id": "gunning-style"
  },
  {
    "name": "Mounted Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Mounted Style.</strong> You are skilled at fighting while mounted. You gain the following benefits:</p>\n<ul>\n<li>Mounting a vehicle or beast only uses 5 feet of your movement, provided you can reach it.</li>\n<li>You can force an attack targeted at your mount to target you instead, provided you are a valid target for that attack.</li>\n</ul>\n",
    "id": "mounted-style"
  },
  {
    "name": "Onslaught Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Onslaught Style.</strong> You are skilled at using your momentum to your advantage. You gain the following benefits:</p>\n<ul>\n<li>You can take the Dash action as a bonus action. If you could already take the Dash action as a bonus action, you can instead take it as a reaction on your turn.</li>\n<li>When you would make an ability check to attempt to shove or trip a creature, you can make a melee weapon attack against the target's AC instead of a contested check. If you are wielding your weapon in two hands, you make this attack roll with advantage.</li>\n</ul>\n",
    "id": "onslaught-style"
  },
  {
    "name": "Poisoner Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Poisoner Style.</strong> You are skilled at with the subtlety of poisons. You gain the following benefits:</p>\n<ul>\n<li>You can apply poisons with your bonus action, instead of your action. If you could already apply poisons as a bonus action, you can instead do so as a reaction on your turn.</li>\n<li>When a creature rolls a 1 on the saving throw against a poison you control, they treat the effect's damage as if it had rolled the maximum.</li>\n</ul>\n",
    "id": "poisoner-style"
  },
  {
    "name": "Protection",
    "mechanics": [
      {
        "name": "Protection",
        "moreInfo": {
          "model": "fighting-styles",
          "id": "protection"
        },
        "type": "reaction",
        "shortDesc": "When a creature you can see attacks a target other than you that is within <me-distance length=\"5\" /> of you, expend one barrier tick to impose disadvantage on the attack roll. If the attack hits, the damage is reduced by your barrier tick roll."
      }
    ],
    "type": "fighting-styles",
    "html": "<p>When a creature you can see attacks a target other than you that is within <me-distance length=\"5\" /> of you, you can use your reaction and expend one barrier tick to impose disadvantage on the attack roll. If the attack hits, the damage is reduced by your barrier tick roll.</p>\n",
    "id": "protection"
  },
  {
    "name": "Secured Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Secured Style.</strong> You are skilled at fighting with weapons in atypical places. You gain the following benefits:</p>\n<ul>\n<li>At the start of each of your turns while wielding a fixed weapon, you can choose to treat the weapon as a light shield until the start of your next turn. If you do so, you can't make attacks with the weapon for the duration.</li>\n<li>You can benefit from fixed weapons while the hand is full.</li>\n</ul>\n",
    "id": "secured-style"
  },
  {
    "name": "Sentinel Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Sentinel Style.</strong> You are skilled at techniques that take advantage of every drop in any enemy's guard. You gain the following benefits:</p>\n<ul>\n<li>Creatures provoke an opportunity attack when they move to within your reach or move 5 feet or greater while within your reach.</li>\n<li>When you hit a creature that is no more than one size larger than you with an opportunity attack, the creature gains 4 slowed levels until the end of the current turn.</li>\n</ul>\n",
    "id": "sentinel-style"
  },
  {
    "name": "Sharpshooter Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Sharpshooter Style.</strong> You are skilled with firing at distant targets. You gain the following benefits:</p>\n<ul>\n<li>You can use your bonus action to mark a target greater than 30 feet from you that you can see. If you do so, and that target moves at least 5 feet before the start of your next turn, they provoke an opportunity attack from you, and you can make a ranged weapon attack with a blaster weapon for that opportunity attack.</li>\n<li>Your ranged weapon attacks reduce partial cover by one step (from three-quarters to half or half to one-quarter) against targets greater than 30 feet from you. If the target has one-quarter cover, you ignore it entirely.</li>\n<li>Grasping a two-handed weapon you are wielding in only one hand with your other hand no longer requires your object interaction.</li>\n</ul>\n",
    "id": "sharpshooter-style"
  },
  {
    "name": "Shield Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Shield Style.</strong> You are skilled at using your shield to defend your allies as well as yourself. You gain the following benefits:</p>\n<ul>\n<li>You are no longer restricted to wielding light weapons while wielding a heavy shield.</li>\n<li>You can use a bonus action to try to shove or trip a creature within 5 feet of you with your shield.</li>\n<li>When you use a shield as an improvised weapon, you are considered proficient in it, light shields are considered to have the light and fixed weapon properties, and heavy shields are considered to have the heavy weapon property.</li>\n</ul>\n",
    "id": "shield-style"
  },
  {
    "name": "Snapshot Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Snapshot Style.</strong> You are skilled at getting up close and personal. You gain the following benefits:</p>\n<ul>\n<li>You no longer have disadvantage on ranged weapon attacks due to being within 5 feet of a hostile creature.</li>\n<li>Your ranged weapon attacks reduce partial cover by one step (from three-quarters to half or half to one-quarter) against targets within 30 feet of you. If the target has one-quarter cover, you ignore it entirely.</li>\n<li>Your blaster weapon damage rolls against creatures within 30 feet of you gain a minimum roll threshold, discussed in chapter 7.</li>\n<li>Grasping a two-handed weapon you are wielding in only one hand with your other hand no longer requires your object interaction.</li>\n</ul>\n",
    "id": "snapshot-style"
  },
  {
    "name": "Sniper",
    "mechanics": [
      {
        "name": "Sniper",
        "moreInfo": {
          "model": "edges",
          "id": "FS_sniper"
        },
        "type": "global-note",
        "subType": "action",
        "attack": "ranged",
        "value": "Sniper"
      }
    ],
    "type": "fighting-styles",
    "html": "<p>If no hostile creature is within <me-distance length=\"30\" /> of you, gain +2 to damage rolls on attacks made with a sniper rifle.</p>\n",
    "id": "sniper"
  },
  {
    "name": "Split Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Split Style.</strong> You are skilled at fighting with interlocking weapons. You gain the following benefits:</p>\n<ul>\n<li>When you engage in Double-Weapon Fighting, you can add your ability modifier to the attack roll of your Double-Weapon Fighting attack as long as it doesn't already include that modifier.</li>\n<li>When you engage in Two-Weapon Fighting, you can add your ability modifier to the damage roll of your Two-Weapon Fighting attack as long as it doesn't already include that modifier.</li>\n</ul>\n",
    "id": "split-style"
  },
  {
    "name": "Spotting Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Spotting Style.</strong> You are skilled at keeping track of your surroundings. You gain the following benefits:</p>\n<ul>\n<li>You can take the Search action as a bonus action. If you could already take the Search action as a bonus action, you can instead take it as a reaction on your turn.</li>\n<li>You have advantage on ability checks and saving throws to determine the nature of illusions. If you would already have advantage, you can instead reroll one of the dice once.</li>\n</ul>\n",
    "id": "spotting-style"
  },
  {
    "name": "Superiority Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Superiority Style.</strong> You are skilled at utilizing maneuvers to enhance your skills on the battlefield. You gain the following benefits:</p>\n<ul>\n<li>You learn one maneuver, detailed in Chapter 13. Your maneuver ability is Strength, Dexterity, or Constitution for physical maneuvers (your choice), Intelligence, Wisdom, or Charisma for mental maneuvers (your choice), and an ability of your choice for general maneuvers.</li>\n<li>You gain one superiority die, which is a d4. This die changes as you gain levels: to d6 at 5th level, to d8 at 9th level, to d10 at 13th level, and to d12 at 17th level. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.</li>\n</ul>\n",
    "id": "superiority-style"
  },
  {
    "name": "The Free Hand",
    "mechanics": [
      {
        "name": "The Free Hand",
        "moreInfo": {
          "model": "edges",
          "id": "FS_the-free-hand"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Free Hand"
      }
    ],
    "type": "fighting-styles",
    "html": "<p>When holding no more than one light, non-two-handed weapon, you gain a +2 bonus to hit with ranged power attacks.</p>\n",
    "id": "the-free-hand"
  },
  {
    "name": "Throwing Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Throwing Style.</strong> You are skilled with the techniques of throwing weapons. You gain the following benefits:</p>\n<ul>\n<li>Whenever you make a ranged attack with a thrown weapon, you can immediately draw another weapon.</li>\n<li>Whenever you make a ranged attack with a thrown weapon, you can move up to 5 feet without provoking opportunity attacks.</li>\n<li>When you miss with a ranged attack with a thrown weapon, you can use your bonus action to repeat the attack against a creature within 15 feet and behind your initial target. Any modifications to the original attack roll, such as advantage, disadvantage, or without your proficiency bonus, also affect this attack roll.</li>\n</ul>\n",
    "id": "throwing-style"
  },
  {
    "name": "Twin-Blade Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Twin-Blade Style.</strong> You are skilled at fighting with double-bladed weapons. You gain the following benefits:</p>\n<ul>\n<li>When you engage in Double-Weapon Fighting, you can add your ability modifier to the attack roll of your Double-Weapon Fighting attack as long as it doesn't already include that modifier.</li>\n<li>Grasping a double weapon you are wielding in only one hand with your other hand no longer requires your object interaction.</li>\n</ul>\n",
    "id": "twin-blade-style"
  },
  {
    "name": "Versatile Style",
    "source": "PHB",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "weapon",
          "special": "twf"
        },
        "augmentTypes": [
          "damage"
        ],
        "abilityMod": true
      }
    ],
    "type": "fighting-styles",
    "html": "<p><strong>Versatile Style.</strong> You are skilled at using weapons in different ways. You gain the following benefits:</p>\n<ul>\n<li>When you miss with a melee weapon attack on your turn while wielding a versatile weapon with which you are proficient in two hands, you can use your bonus action to repeat the attack roll against the same target using one hand. Any modifications to the original attack roll, such as advantage, disadvantage, or without your proficiency bonus, also affect this attack roll.</li>\n<li>When you miss with a melee weapon attack on your turn while wielding a versatile weapon with which you are proficient in one hand, you can use your bonus action to attempt to shove or trip that creature. Any modifications to the original attack roll, such as advantage, disadvantage, or without your proficiency bonus, also affect this ability check.</li>\n<li>Grasping a versatile weapon you are wielding in only one hand with your other hand no longer requires your object interaction.</li>\n</ul>\n",
    "id": "versatile-style"
  },
  {
    "name": "Ashla",
    "mechanics": [
      {
        "name": "Ashla",
        "moreInfo": {
          "model": "force-affinities",
          "id": "ashla"
        },
        "type": "global-note",
        "subType": "power",
        "value": "FA: Ashla"
      }
    ],
    "html": "<p>When you successfully cast a light side power, either your or the target’s (your choice) hit point maximum and\ncurrent hit points increase by an amount equal to the power’s level. This effect lasts for 1 minute. You can only\nhave one instance of this effect active at a time.</p>\n",
    "id": "ashla",
    "type": "force-affinities"
  },
  {
    "name": "Bendu",
    "mechanics": [
      {
        "type": "augment",
        "value": {
          "model": "class-features",
          "id": "consular.forcecasting",
          "limit": [
            "bonus-pc-resource"
          ],
          "instances": 0
        },
        "merge": {
          "value": {
            "type": "multiple",
            "value": [
              {
                "type": "mod",
                "value": "cha"
              },
              {
                "type": "mod",
                "value": "wis"
              }
            ]
          }
        }
      }
    ],
    "html": "<p>When you successfully cast a light side power, either your or the target’s (your choice) hit point maximum and\ncurrent hit points increase by an amount equal to the power’s level. This effect lasts for 1 minute. You can only\nhave one instance of this effect active at a time.</p>\n",
    "id": "bendu",
    "type": "force-affinities"
  },
  {
    "name": "Bogan",
    "mechanics": [
      {
        "type": "attack-augment",
        "attackLimit": {
          "model": "power",
          "modelTypes": "dark"
        },
        "augmentTypes": [
          "damage"
        ],
        "minRollThreshold": true
      }
    ],
    "html": "<p>When you successfully cast a light side power, either your or the target’s (your choice) hit point maximum and\ncurrent hit points increase by an amount equal to the power’s level. This effect lasts for 1 minute. You can only\nhave one instance of this effect active at a time.</p>\n",
    "id": "bogan",
    "type": "force-affinities"
  },
  {
    "name": "Careful Power",
    "mechanics": [
      {
        "name": "Careful Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "careful-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Careful Power"
      }
    ],
    "html": "<p>When you cast a power that forces other creatures to make a saving throw, you can protect some of those creatures\nfrom the power’s full force. To do so, you spend 1 additional force point and choose a number of those\ncreatures up to your Wisdom or Charisma modifier (your choice, minimum of one). A chosen creature automatically succeeds\non its saving throw against the power.</p>\n",
    "id": "careful-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Distant Power",
    "mechanics": [
      {
        "name": "Distant Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "distant-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Distant Power"
      }
    ],
    "html": "<p>When you cast a power that has a range of 5 feet or greater, you can spend 1 additional force point to double the range of the power.</p>\n<p>Alternatively, when you cast a power that has a range of touch, you can spend 1 additional force point to make the range of the power 30 feet.</p>\n",
    "id": "distant-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Extended Power",
    "mechanics": [
      {
        "name": "Extended Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "extended-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Extended Power"
      }
    ],
    "html": "<p>When you cast a power that has a duration of 1 minute or longer, you can spend 1 additional force point to double its duration, to a maximum duration of 24 hours.</p>\n",
    "id": "extended-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Heightened Power",
    "mechanics": [
      {
        "name": "Heightened Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "heightened-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Heightened Power"
      }
    ],
    "html": "<p>When you cast a power that forces a creature to make a saving throw to resist its effects, you can spend 3 additional force points to give one target of the power disadvantage on its first saving throw made against the power.</p>\n",
    "id": "heightened-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Improved Power",
    "mechanics": [
      {
        "name": "Improved Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "improved-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Improved Power"
      }
    ],
    "html": "<p>When you roll damage for a power, you can spend 1 additional force point to reroll a number of the damage dice up to your Wisdom or Charisma modifier (your choice, minimum of one). You must use the new rolls.</p>\n<p>You can use Improved Power even if you have already used a different Force-Empowered Casting option during the casting of the power.</p>\n",
    "id": "improved-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Lingering Power",
    "mechanics": [
      {
        "name": "Lingering Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "lingering-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Lingering Power"
      }
    ],
    "html": "<p>When you cast a power that requires concentration to maintain you can choose to spend 3 additional force points. If you do, when you lose concentration on the power, the power will not end until the end of your next turn.</p>\n",
    "id": "lingering-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Pinpoint Power",
    "mechanics": [
      {
        "name": "Pinpoint Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "pinpoint-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Pinpoint Power"
      }
    ],
    "html": "<p>When you cast a power that allows you to force creatures in an area to make a saving throw you can instead spend 1\nforce point and make a ranged force attack against a single target that would be in the range. On a hit the target\nsuffers the effects as though they failed their saving throw.</p>\n",
    "id": "pinpoint-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Quickened Power",
    "mechanics": [
      {
        "name": "Quickened Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "quickened-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Quickened Power"
      }
    ],
    "html": "<p>When you cast a power that has a casting time of 1 action, you can spend 2 additional force points to change the casting time to 1 bonus action for this casting.</p>\n",
    "id": "quickened-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Refocused Power",
    "mechanics": [
      {
        "name": "Refocused Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "refocused-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Refocused Power"
      }
    ],
    "html": "<p>When you are forced to make a Constitution saving throw to maintain concentration on a power you can use your reaction and spend 2 force points to automatically succeed on the saving throw.</p>\n<p>You can use Refocused Power even if you have already used a different Force-Empowered Casting option during the casting of the power.</p>\n",
    "id": "refocused-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Seeking Power",
    "mechanics": [
      {
        "name": "Seeking Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "seeking-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Seeking Power"
      }
    ],
    "html": "<p>If you miss with a force power that calls for an attack roll, you can spend 2 force points to reroll the attack. You must use the new roll.</p>\n<p>You can use Seeking Power even if you have already used a different Force-Empowered Casting option during the casting of the power.</p>\n",
    "id": "seeking-power",
    "type": "force-empowered-castings"
  },
  {
    "name": "Twinned Power",
    "mechanics": [
      {
        "name": "Twinned Power",
        "moreInfo": {
          "model": "force-empowered-castings",
          "id": "twinned-power"
        },
        "type": "global-note",
        "subType": "power",
        "value": "Twinned Power"
      }
    ],
    "html": "<p>When you cast a power that can only have one target and doesn’t have a range of self, you can spend a number of\nadditional force points equal to the power’s level to choose a second target in range with the same power\n(1 force point if the power is at-will).</p>\n",
    "id": "twinned-power",
    "type": "force-empowered-castings"
  }
]