[
  {
    "name": "Aleena",
    "source": "ec",
    "speedColor": "",
    "alignment": "Aleena’s benevolent yet curious nature causes them to tend toward chaotic light side, though there are exceptions.",
    "size": "Aleena typically stand 2 and a half to 3 feet tall and generally weigh about 35 lbs. Regardless of your position in that range, your size is Small.",
    "age": "Aleena reach adulthood in their late teens and live to be about 80.",
    "languageColor": "You can speak, read, and write Galactic Basic and Aleena. Aleena is characterized by its use of short syllables and energetic movements to convey urgency and emotion.",
    "skinColor": "Blue, gray, purple, tan",
    "hairColor": "None",
    "eyeColor": "Blue",
    "distinctions": "Short stature, scaly skin, crested head",
    "homeworld": "Aleen",
    "language": "Aleena",
    "height": {
      "base": "2'1\"",
      "mod": "+2d4\""
    },
    "weight": {
      "base": "35 lb.",
      "mod": "x1 lb."
    },
    "cSize": "small",
    "mechanics": [
      {
        "type": "asi",
        "amount": 2,
        "ability": "dex"
      },
      {
        "type": "asi",
        "amount": 1,
        "ability": "cha"
      },
      {
        "type": "speed",
        "speed": "walk",
        "distance": 25
      },
      {
        "type": "language",
        "value": [
          "galactic_basic",
          "aleena"
        ]
      }
    ],
    "html": "<me-tpg e=\"div\" s=\"h3\">BIOLOGY AND APPEARANCE</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Aleena are short, reptilian bipeds with large eyes and wide mouths full of small, sharp teeth. Aleena’s bodies are long compared to their short arms and stubby legs. Warm-blooded reptiles, they possess exceptional reflexes as well as a fast metabolism which allow them to convert food into energy very rapidly in order to escape predators on their harsh home planet.</p>\n<me-tpg e=\"div\" s=\"h3\">SOCIETY AND CULTURE</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Aleena are social and tend to thrive best in with close-knit teams if not with their own kind. They develop strong loyalties to friends and protect those they care about fiercely. Due to their inborn curiosity, the aleena are stereotypically galactic travelers, tourists in every sense. This, combined with their strong dedication to their relatives, results in aleena families traveling even to most unusual and dangerous locations just to see its sights. The appearance of aleena family walking through an intergalactic metropolis is a common sight on many planets. The aleena’s love of sports and particularly, adventure and thrill sports, draw many into the galactic community. Most who enter professional classes are experts or diplomats.</p>\n<p>Aleena settlements were small, and most individuals were part of a single lineage, or tahiko. The leader of each tahiko led the community, and represented their wishes to the planetary advisory body. The advisory body elected a king to govern the planet, and was generally revered as a religious figure as they led religious ceremonies.</p>\n<me-tpg e=\"div\" s=\"h3\">NAMES</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Aleena names are generally short and guttural, with longer names being saved for royalty. Surnames are based on their tahiko, or tribal lineage.</p>\n<p><strong>Male Names.</strong> Batts, Gratz, Wakka, Zakan, Zetts</p>\n<p><strong>Female Names.</strong> Arkei, Harza, Sutci, Tsuon, Yenn,</p>\n<p><strong>Surnames.</strong> Anares, Kylar, Ors, Practes, Targae</p>\n",
    "id": "aleena",
    "abilityScoreIncrease": "+2 Dexterity, +1 Charisma",
    "subspecies": false
  },
  {
    "name": "Bith",
    "source": "phb",
    "speedColor": "",
    "alignment": "Biths’ benevolent nature causes them to tend toward the light side, though there are exceptions.",
    "size": "Bith typically stand 5 to 6 feet tall and generally weigh about 120 lbs. Regardless of your position in that range, your size is Medium.",
    "age": "Bith reach adulthood in their late teens and live less than a century.",
    "languageColor": "You can speak, read, and write Galactic Basic, Bith, and one more language of your choice.",
    "skinColor": "Green, pink, white, or yellow",
    "hairColor": "None",
    "eyeColor": "Black",
    "distinctions": "Large cranium, acute senses of smell and hearing",
    "homeworld": "Clak'dor VII",
    "language": "Bith",
    "height": {
      "base": "4'9\"",
      "mod": "+2d6\""
    },
    "weight": {
      "base": "100 lb.",
      "mod": "x(2d4) lb."
    },
    "cSize": "medium",
    "mechanics": [
      {
        "type": "asi",
        "amount": 2,
        "ability": "int"
      },
      {
        "type": "asi",
        "amount": 1,
        "ability": "dex"
      },
      {
        "type": "speed",
        "speed": "walk",
        "distance": 30
      },
      {
        "type": "language",
        "value": [
          "galactic_basic",
          "bith"
        ]
      },
      {
        "type": "language-choice",
        "options": true
      }
    ],
    "html": "<me-tpg e=\"div\" s=\"h3\">BIOLOGY AND APPEARANCE</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Bith are craniopods with pale pink, yellow, or green skin, large heads, large lidless eyes, toeless feet, and long fingers. Their thumb and small finger were both fully opposable. The bith’s internal systems are different from most humanoids, as the bith have only one lung, and exhale through their skin. Bith also lack a proper nose, instead having highly sensitive olfactory organs hidden in the skin-flaps of their cheeks.</p>\n<p>The other bith senses are also acute. Bith can sense the tonal qualities of sound as well as other species sensed colors. Their eyes, as big as a Menahuun’s, can see microscopic details of nearby objects, but are extremely nearsighted as a result. An interesting side effect of their incredible sensors is the effect of sonic grenades, or screamers, on them. It is described as causing their heads to explode. Similarly, bith have high manual dexterity which helps them manipulate fine tools, though their physical prowess with gross motor skills was only average.</p>\n<me-tpg e=\"div\" s=\"h3\">SOCIETY AND CULTURE</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Bith are one of the galaxy’s most ancient civilizations, with a history going back millions of years. This antiquity garners respect in certain quarters, such as among the Gree, who gave them more respect than other, “younger” species. Their society is highly regimented, with everything from mate selection to political leadership controlled by sophisticated computer programs.</p>\n<me-tpg e=\"div\" s=\"h3\">NAMES</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Bith names are quite diverse. Some names look complicated and difficult to pronounce, while others are quite simple.</p>\n<p><strong>Male Names.</strong> Fedu, Jenkiss, Kabadons, Ph’teumkiass</p>\n<p><strong>Female Names.</strong> Duhia, F’hubama, R’hothal, Thidus</p>\n<p><strong>Surnames.</strong> D’intes, Hern, K’sarorn, Nimum, Rumo</p>\n",
    "id": "bith",
    "abilityScoreIncrease": "+2 Intelligence, +1 Dexterity",
    "subspecies": false
  },
  {
    "name": "Bothan",
    "source": "phb",
    "speedColor": "",
    "alignment": "Bothans’ duplicitous nature causes them to tend toward the dark side, though there are exceptions.",
    "size": "Bothans stand 4-5 feet tall and weigh under 100 pounds. Regardless of your position in that range, your size is Medium.",
    "age": "Bothans reach adulthood in their late teens and live less than a century.",
    "languageColor": "You can speak, read, and write Galactic Basic and Bothese. Bothese had a great influence on the forming of Galactic Basic; the two languages share many cognates.",
    "skinColor": "Brown",
    "hairColor": "Black, brown, or gray (with age)",
    "eyeColor": "Brown or green",
    "distinctions": "Diminutive stature, mood-sensitive fur",
    "homeworld": "Bothawui",
    "language": "Bothese",
    "height": {
      "base": "4'3\"",
      "mod": "+2d4\""
    },
    "weight": {
      "base": "60 lb.",
      "mod": "x(2d4) lb."
    },
    "cSize": "medium",
    "mechanics": [
      {
        "type": "asi",
        "amount": 2,
        "ability": "int"
      },
      {
        "type": "asi",
        "amount": 1,
        "ability": "dex"
      },
      {
        "type": "speed",
        "speed": "walk",
        "distance": 30
      },
      {
        "type": "language",
        "value": [
          "galactic-basic",
          "bothese"
        ]
      }
    ],
    "html": "<me-tpg e=\"div\" s=\"h3\">BIOLOGY AND APPEARANCE</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Bothans are a short species of furry humanoids. Bothans are covered in fur which shifted in response to their emotional state by way of gentle ripplings. It is this trait, named Wrendui, that betrays them when members of their kind intend to be duplicitous in their dealings with others. They possess tapered pointed ears, and both males and females were known to sport beards.</p>\n<p>Bothans are able to interbreed with the other species, though it is rare that they do so. Such hybrids somewhat resembled baseline humans with haunches, hooves, fur, pointed ears and a long tail.</p>\n<me-tpg e=\"div\" s=\"h3\">SOCIETY AND CULTURE</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Bothan culture is guided by the philosophy and principles from the ancient text known as The Way, written by Golm Fervse’dra. In this “Bothan Way”, the pursuit of power and influence is paramount. Thus, individual bothans put their own political and economic success above all other concerns, and as a species, bothans put their own advancement ahead of other intergalactic interests. The volume of backstabbing, subtle character assassination and political maneuvering in bothan society is dizzying, and results in many species stereotyping bothans as untrustworthy. In fact, most bothans are habitually paranoid, believing that anyone who’s not working with them, is working against them. In times of crisis, the focus of bothan society shifts to a survivalist state known as “ar’krai”. When engaged in ar’krai, all fit bothans volunteer to defend their species from impending extinction.</p>\n<me-tpg e=\"div\" s=\"h3\">NAMES</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Male bothan names are often trickey while female’s are soft. Surnames are familial.</p>\n<p><strong>Male Names.</strong> Garc, Hibriak, Nith, Tramom, Ventagt</p>\n<p><strong>Female Names.</strong> Ceerriah, Dhaim, Gnam, Meenn, Vit</p>\n<p><strong>Surnames.</strong> Bwif’livi, Gra’kit, Hia’faitu, Main’dil</p>\n",
    "id": "bothan",
    "abilityScoreIncrease": "+2 Intelligence, +1 Dexterity",
    "subspecies": false
  },
  {
    "name": "Cathar",
    "source": "phb",
    "speedColor": "",
    "skinColor": "Gold to yellow-brown with dark stripes",
    "hairColor": "Brown, black, or grey",
    "eyeColor": "Yellow or brown",
    "distinctions": "Lion-like features",
    "height": {
      "base": "4'9\"",
      "mod": "+2d12\""
    },
    "weight": {
      "base": "130 lb.",
      "mod": "x(2d4) lb."
    },
    "homeworld": "Cathar",
    "language": "Catharese",
    "age": "Cathar reach adulthood in their late teens and live less than a century.",
    "alignment": "Cathar tend toward no particular alignment. The best and worst are found among them.",
    "size": "Cathar range from 5 to 7 feet tall, and can weigh up to 300 lbs. Regardless of your position in that range, your size is Medium.",
    "languageColor": "You can speak, read, and write Galactic Basic and Catharese.",
    "cSize": "medium",
    "mechanics": [
      {
        "type": "asi",
        "amount": 2,
        "ability": "dex"
      },
      {
        "type": "asi",
        "amount": 1,
        "ability": "cha"
      },
      {
        "type": "speed",
        "speed": "walk",
        "distance": 30
      },
      {
        "type": "language",
        "value": [
          "galactic_basic",
          "catharese"
        ]
      }
    ],
    "html": "<me-tpg e=\"div\" s=\"h3\">BIOLOGY AND APPEARANCE</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>The Cathar have fur-covered bodies with thick manes as well as prominent, retractable claws that can deliver powerful killing attacks on foes and prey. Their bodies also possess rapid healing abilities. These traits make them the perfect hand-to-hand specialists.</p>\n<p>The Cathar species also has two subspecies, known as the Juhani and the Myr Rho. Both of these are notably less catlike but are physicaly disimilar from mainline Cathar.</p>\n<me-tpg e=\"div\" s=\"h3\">SOCIETY AND CULTURE</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>AOn their homeworld, Cathar live in cities built into giant trees, and are organized into clans governed by elders. Stories of their great heroes were often carved into the trunks of these tree-homes for following generations to see. The Cathar mate for life, to the extent that when one mate dies, the survivor never has a relationship with another. Cathar clan society includes great pageants and celebrations, especially for their heroes. Their religion includes a ritual known as the &quot;Blood Hunt,&quot; in which Cathar warriors individually engaged in combat against entire nests of Kiltik in order to gain honor and purge themselves of inner darkness. The native language of the Cathar is Catharese, which included the emphasis of some spoken words with a growl.</p>\n<me-tpg e=\"div\" s=\"h3\">NAMES</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>Cathar names can sound both melodic and fairly gutteral, but they almost always sound strong and fierce. Female names are typically longer than male names. Surnames are usually one syllable.</p>\n<p><strong>Male Names.</strong> Crurbirr, Isyrr, Nynorr, Suro, Tukarr</p>\n<p><strong>Female Names.</strong> Cuwin, Jyvohr, Mulahr, Solyri</p>\n<p><strong>Surnames.</strong> Jin, Ki, Mak, Rhir, Ta</p>\n",
    "id": "cathar",
    "abilityScoreIncrease": "+2 Dexterity, +1 Charisma",
    "subspecies": false
  }
]