[
  {
    "name": "Bith",
    "speedColor": "",
    "alignment": "Biths’ benevolent nature causes them to tend toward the light side, though there are exceptions.",
    "size": "Bith typically stand 5 to 6 feet tall and generally weigh about 120 lbs. Regardless of your position in that range, your size is Medium.",
    "age": "Bith reach adulthood in their late teens and live less than a century.",
    "languageColor": "You can speak, read, and write Galactic Basic, Bith, and one more language of your choice.",
    "skinColor": "Green, pink, white, or yellow",
    "hairColor": "None",
    "eyeColor": "Black",
    "distinctions": "Large cranium, acute senses of smell and hearing",
    "homeworld": "Clak'dor VII",
    "language": "Bith",
    "height": {
      "base": "4'9\"",
      "mod": "+2d6\""
    },
    "weight": {
      "base": "100 lb.",
      "mod": "x(2d4) lb."
    },
    "cSize": "medium",
    "mechanics": [
      {
        "type": "asi",
        "amount": 2,
        "ability": "int"
      },
      {
        "type": "asi",
        "amount": 1,
        "ability": "dex"
      },
      {
        "type": "speed",
        "speed": "walk",
        "distance": 30
      },
      {
        "type": "language",
        "value": [
          "galactic-basic",
          "bith"
        ]
      },
      {
        "type": "language-choice",
        "options": true
      }
    ],
    "html": "<h3>BIOLOGY AND APPEARANCE</h3>\n<p>Bith are craniopods with pale pink, yellow, or green skin, large heads, large lidless eyes, toeless feet, and long fingers. Their thumb and small finger were both fully opposable. The bith’s internal systems are different from most humanoids, as the bith have only one lung, and exhale through their skin. Bith also lack a proper nose, instead having highly sensitive olfactory organs hidden in the skin-flaps of their cheeks.</p>\n<p>The other bith senses are also acute. Bith can sense the tonal qualities of sound as well as other species sensed colors. Their eyes, as big as a Menahuun’s, can see microscopic details of nearby objects, but are extremely nearsighted as a result. An interesting side effect of their incredible sensors is the effect of sonic grenades, or screamers, on them. It is described as causing their heads to explode. Similarly, bith have high manual dexterity which helps them manipulate fine tools, though their physical prowess with gross motor skills was only average.</p>\n<h3>SOCIETY AND CULTURE</h3>\n<p>Bith are one of the galaxy’s most ancient civilizations, with a history going back millions of years. This antiquity garners respect in certain quarters, such as among the Gree, who gave them more respect than other, “younger” species. Their society is highly regimented, with everything from mate selection to political leadership controlled by sophisticated computer programs.</p>\n<h3>NAMES</h3>\n<p>Bith names are quite diverse. Some names look complicated and difficult to pronounce, while others are quite simple.</p>\n<p><strong>Male Names.</strong> Fedu, Jenkiss, Kabadons, Ph’teumkiass</p>\n<p><strong>Female Names.</strong> Duhia, F’hubama, R’hothal, Thidus</p>\n<p><strong>Surnames.</strong> D’intes, Hern, K’sarorn, Nimum, Rumo</p>\n",
    "id": "bith",
    "subspecies": false
  },
  {
    "name": "Bothan",
    "speedColor": "",
    "alignment": "Bothans’ duplicitous nature causes them to tend toward the dark side, though there are exceptions.",
    "size": "Bothans stand 4-5 feet tall and weigh under 100 pounds. Regardless of your position in that range, your size is Medium.",
    "age": "Bothans reach adulthood in their late teens and live less than a century.",
    "languageColor": "You can speak, read, and write Galactic Basic and Bothese. Bothese had a great influence on the forming of Galactic Basic; the two languages share many cognates.",
    "skinColor": "Brown",
    "hairColor": "Black, brown, or gray (with age)",
    "eyeColor": "Brown or green",
    "distinctions": "Diminutive stature, mood-sensitive fur",
    "homeworld": "Bothawui",
    "language": "Bothese",
    "height": {
      "base": "4'3\"",
      "mod": "+2d4\""
    },
    "weight": {
      "base": "60 lb.",
      "mod": "x(2d4) lb."
    },
    "cSize": "medium",
    "mechanics": [
      {
        "type": "asi",
        "amount": 2,
        "ability": "int"
      },
      {
        "type": "asi",
        "amount": 1,
        "ability": "dex"
      },
      {
        "type": "speed",
        "speed": "walk",
        "distance": 30
      },
      {
        "type": "language",
        "value": [
          "galactic-basic",
          "bothese"
        ]
      }
    ],
    "html": "<h3>BIOLOGY AND APPEARANCE</h3>\n<p>Bothans are a short species of furry humanoids. Bothans are covered in fur which shifted in response to their emotional state by way of gentle ripplings. It is this trait, named Wrendui, that betrays them when members of their kind intend to be duplicitous in their dealings with others. They possess tapered pointed ears, and both males and females were known to sport beards.</p>\n<p>Bothans are able to interbreed with the other species, though it is rare that they do so. Such hybrids somewhat resembled baseline humans with haunches, hooves, fur, pointed ears and a long tail.</p>\n<h3>SOCIETY AND CULTURE</h3>\n<p>Bothan culture is guided by the philosophy and principles from the ancient text known as The Way, written by Golm Fervse’dra. In this “Bothan Way”, the pursuit of power and influence is paramount. Thus, individual bothans put their own political and economic success above all other concerns, and as a species, bothans put their own advancement ahead of other intergalactic interests. The volume of backstabbing, subtle character assassination and political maneuvering in bothan society is dizzying, and results in many species stereotyping bothans as untrustworthy. In fact, most bothans are habitually paranoid, believing that anyone who’s not working with them, is working against them. In times of crisis, the focus of bothan society shifts to a survivalist state known as “ar’krai”. When engaged in ar’krai, all fit bothans volunteer to defend their species from impending extinction.</p>\n<h3>NAMES</h3>\n<p>Male bothan names are often trickey while female’s are soft. Surnames are familial.</p>\n<p><strong>Male Names.</strong> Garc, Hibriak, Nith, Tramom, Ventagt</p>\n<p><strong>Female Names.</strong> Ceerriah, Dhaim, Gnam, Meenn, Vit</p>\n<p><strong>Surnames.</strong> Bwif’livi, Gra’kit, Hia’faitu, Main’dil</p>\n",
    "id": "bothan",
    "subspecies": false
  }
]