[
  {
    "type": "artisan",
    "name": "Archaeologist kit",
    "html": "<p>This kit contains instruments used to carefully collect crystals, gems, relics, and other heirlooms. Proficiency with this kit lets you add your proficiency bonus to any ability checks you make to classify, collect, and polish gems and relics.</p>\n<p><strong>SURVIVAL</strong>.<br>\nWhen searching in the wild, you can more easily search for places that might house relics.</p>\n<p><strong>INVESTIGATION</strong>.\nYou can easily spot the location of potential gemstones or other precious relics.</p>\n<p><strong>PERSUASION</strong>.\nWhen bartering while precious stones or relics are involved, you can more easily negotiate a fair price.</p>\n<p><strong>CRYSTAL ENHANCEMENT</strong>.\nOver the course of a short or long rest, you can make a DC 15 archaelogist kit check to temporarily improve a lightweapon or focus generator. To use this benefit, you must have archaelogist kit with you, and the object must be within reach. On a success, once before your next short or long rest, a character wielding this lightweapon can gain a bonus to one weapon damage roll, or focus generator can gain a bonus to one force damage or healing roll. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Appraise a gemstone or relic</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "archaeologist_kit"
  },
  {
    "type": "artisan",
    "name": "Armormech’s implements",
    "html": "<p>Armormech’s implements include all of the necessary components to allow you to work raw materials to craft or repair damage to armor and shields.</p>\n<p><strong>LORE</strong>.\nYour expertise lends you additional insight when examining armor and shields.</p>\n<p><strong>INVESTIGATION</strong>.\nYou can spot clues and make deductions that others might overlook when an investigation involves armor and shields.</p>\n<p><strong>STEALTH</strong>.\nYour greater understanding of armor you - or your allies - wear allows for more cautious movement.</p>\n<p><strong>BOOST ARMOR</strong>.\nOver the course of a short or long rest, you can make a DC 15 armormech’s implements check to temporarily improve a suit of armor or a shield. To use this benefit, you must have armormech’s implements with you, and the object must be within reach. On a success, once before your next short or long rest, a character wearing this armor or wielding this shield can gain a bonus to AC against one attack. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Repair a suit of armor or a shield</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Sunder a suit of armor or a shield</td>\n<td>10</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "armormechs_implements"
  },
  {
    "type": "artisan",
    "name": "Armorsmith's Workbench",
    "html": "<p>An armorsmith's workbench allows you to work with alloys and ceramic plates, letting you reshape armor for different species,\nrepair damage, or install armor mods.</p>\n<p><strong>History</strong>. Your expertise lends you additional insight when examining heavy and medium armor.</p>\n<p><strong>Investigation</strong>. You can spot clues and make deductions that others might overlook when an investigation involves heavy or medium armor.</p>\n<me-tpg e=\"div\" s=\"h3\">Activities</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>With access to your workbench, you can perform one of the following activities as part of a long rest.</p>\n<ul>\n<li><strong>Augment or repair armor</strong>. Adjust a suit of heavy or medium armor to fit another species or repair a piece of used\nheavy or medium armor. Repaired armor can be sold for one half its market value. Consumes 2 omni-gel.</li>\n<li><strong>Craft armor</strong>.\n<ul>\n<li>Craft a medium or heavy armor set. See the <nuxt-link to=\"/manual/missions#between-missions\">crafting</nuxt-link>\nsection of downtime activities for more information.</li>\n<li>Craft a customizable piece of heavy or medium armor. See the <nuxt-link to=\"/manual/equipment#custom-armor\">creating armor</nuxt-link>\nsection of armor for more information.</li>\n</ul>\n</li>\n<li><strong>Salvage an armor mod</strong>. DC 20. On a success, you can salvage 1 armor mod from a piece of heavy or medium armor. On a failure, the armor\nand all mods are destroyed.</li>\n</ul>\n",
    "id": "armorsmiths-workbench"
  },
  {
    "type": "artisan",
    "name": "Armstech’s implements",
    "html": "<p>Armstech’s implements include all of the necessary components to allow you to work raw materials to craft or repair damage to blasters and vibroweapons.</p>\n<p><strong>LORE</strong>.\nYour expertise lends you additional insight when examining blasters and vibroweapons.</p>\n<p><strong>INVESTIGATION</strong>.\nYou can spot clues and make deductions that others might overlook when an investigation involves blasters and vibroweapons.</p>\n<p><strong>TECHNOLOGY</strong>.\nYou can more readily identify an enhanced blaster or vibroweapons properties.</p>\n<p><strong>AMPLIFY WEAPON</strong>.\nOver the course of a short or long rest, you can make a DC 15 arsmtech’s implements check to temporarily improve a blaster or vibroweapon. To use this benefit, you must have arsmtech’s implements with you, and the object must be within reach. On a success, once before your next short or long rest, a character wielding this weapon can gain a bonus to one weapon attack. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Repair a blaster or vibroweapon</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Sunder a blaster or vibroweapon</td>\n<td>10</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "armstechs_implements"
  },
  {
    "type": "artisan",
    "name": "Artificer’s implements",
    "html": "<p>Artificer’s implements include all of the necessary components to allow you to craft and repair focus generators, holocrons, and lightweapons.</p>\n<p><strong>INSIGHT</strong>.\nYou have greater intuition when dealing with spirits trapped in holocrons.</p>\n<p><strong>LORE</strong>.\nYour expertise lends you additional insight when determining the origin and age of lightweapons.</p>\n<p><strong>TECHNOLOGY</strong>.\nYour knowledge grants you greater understanding when reverse engineering lightweapon or focus generator item modifications.</p>\n<p><strong>LENS IMPROVEMENT</strong>.\nOver the course of a short or long rest, you can make a DC 15 artificer’s implements check to temporarily improve a lightweapon or focus generator. To use this benefit, you must have artificer’s implements with you, and the object must be within reach. On a success, once before your next short or long rest, a character wielding this lightweapon can gain a bonus to one weapon attack roll, or focus generator can gain a bonus to one force attack roll. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Disassemble a lightweapon</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Repair a lightweapon</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Sunder a lightweapon</td>\n<td>10</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "artificers_implements"
  },
  {
    "type": "artisan",
    "name": "Artillerist’s kit",
    "html": "<p>Artillerist’s kits contains all the necessary equipment to create, repair, and modify turrets.</p>\n<p><strong>LORE</strong>.\nYour proficiency allows you to more readily discern the history of any turrets you encounter.</p>\n<p><strong>INVESTIGATION AND PERCEPTION</strong>.\nYour experience lets you more readily identify aftermarket modifications in turrets.</p>\n<p><strong>TURRET IMPROVEMENTS</strong>.\nOver the course of a short or long rest, you can make a DC 15 artillerist’s kit check to temporarily improve a turret. To use this benefit, you must have an artillerist’s kit with you, and the object must be within reach. On a success, once before your next short or long rest, this turret can gain a bonus to one attack roll or a bonus to one save DC. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.\nSample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Disable a turret</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Repair a turret</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "artillerists_kit"
  },
  {
    "type": "artisan",
    "name": "Artist’s implements",
    "html": "<p>Artist’s implements include all of the necessary components to create and store art.</p>\n<p><strong>LORE</strong>.\nYour expertise aids you in uncovering lore of any sort that is attached to a work of art, such as the mystical properties of a painting or the origins of a strange mural found in a dungeon.</p>\n<p><strong>INVESTIGATION AND PERCEPTION</strong>.\nWhen you inspect a painting or a similar work of visual art, your knowledge of the practices behind creating it can grant you additional insight.</p>\n<p><strong>COMMEMORATE EVENT</strong>.\nOver the course of a short or long rest, you can make a DC 15 artist’s implements check to create a depiction of an event, person, or other noteworthy object. To use this benefit, you must have artist’s implements with you. On a success, you create a rendition that perfectly captures the event in question, provided the event happened no more than one day ago. If you have expertise in the tool, you can instead capture an event that happened no more than one week ago.\nSample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Paint an accurate portrait</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Create a painting with a hidden message</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "artists_implements"
  },
  {
    "type": "artisan",
    "name": "Astrotech’s implements",
    "html": "<p>Astrotech’s implements include all of the necessary components to create droid customizations, assemble droids, and modify assembled droids.</p>\n<p><strong>INVESTIGATION</strong>.\nYour discerning eye, coupled with your experience with your tools, lets you identify droids that have aftermarket part customizations installed.</p>\n<p><strong>LORE</strong>.\nYour expertise lets you determine the product line, model, and class of a droid.</p>\n<p><strong>TECHNOLOGY</strong>.\nYour knowledge lets you determine whether a droid has been modified beyond its model specifications, and to what extent.</p>\n<p><strong>REPAIR DROID</strong>.\nOver the course of a short or long rest, you can make a DC 15 astrotech’s implements check to repair a droid. To use this benefit, you must have a astrotech’s implements with you, and droid must be within reach. On a success, for each Hit Die the droid spends to regain hit points, it regains bonus hit points. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Identify a droid’s designation</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Determine if a droid has any modifications</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "astrotechs_implements"
  },
  {
    "type": "artisan",
    "name": "Audiotech’s implements",
    "html": "<p>Audiotech’s implements contain all of the tools necessary to build, repair, and tune instruments.</p>\n<p><strong>PERFORMANCE</strong>.\nFundamental knowledge of instruments enhances your ability to capture the attention of others.</p>\n<p><strong>INVESTIGATION</strong>.\nYour experience makes it easy for you to identify an instrument, including its age and manufacturer, if the manufacturer is widely known.</p>\n<p><strong>LORE</strong>.\nYou can accurately appraise the value of an instrument.</p>\n<p><strong>TUNE INSTRUMENT</strong>.\nOver the course of a short or long rest, you can make a DC 15 audiotech’s implements check to tune or otherwise care for an instrument. To use this benefit, you must have audiotech’s implements with you, and the instrument must be within reach. On a success, once before your next short or long rest, you can gain a bonus to one check you make with the instrument. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Appraise an instrument</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Tune an instrument</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "audiotechs_implements"
  },
  {
    "type": "artisan",
    "name": "Bioanalysis kit",
    "html": "<p>A bioanalysis kit includes all of the necessary components to harvest and store plants, as well as identify their uses.</p>\n<p><strong>MEDICINE</strong>.\nYour mastery of bioanalysis improves your ability to treat illnesses and wounds by augmenting your methods of care with medicinal plants.</p>\n<p><strong>NATURE AND SURVIVAL</strong>.\nWhen you travel in the wild, your skill in bioanalysis makes it easier to identify plants and spot sources of food that others might overlook.</p>\n<p><strong>HERBAL REMEDIES</strong>.\nOver the course of a short or long rest, you can make a DC 15 bioanalysis kit check to help an ally recover. To use this benefit, you must have a bioanalysis kit with you, and access to local flora. On a success, you can remove one poison or disease from a friendly creature within reach.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Find plants</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Identify plants and derivatives</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "bioanalysis_kit"
  },
  {
    "type": "artisan",
    "name": "Biochemist’s kit",
    "html": "<p>A biochemist’s kit includes all of the necessary components to create and house standard adrenals, medpacs, and stimpacs.</p>\n<p><strong>INVESTIGATION</strong>.\nProficiency with biochemist’s kit allows you to unlock more information on Investigation checks involving adrenals, medpacs, and stimpacs.</p>\n<p><strong>PERCEPTION</strong>.\nWhen you inspect an area for clues, proficiency with biochemist’s kit grants additional insight into any chemicals or other substances that might have been used in the area.</p>\n<p><strong>MEDPAC IMPROVEMENT</strong>.\nOver the course of a short or long rest, you can make a DC 15 biochemist’s kit check to temporarily improve the potency of one medpac. To use this benefit, you must have a biochemist’s kit with you, and the medpac must be within reach. If the medpac is consumed before the end of your next short or long rest, when a creature uses this medpac, they take the maximum instead of rolling.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Create a traumakit</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Identify a chemical</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Create a medpac</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Create an antidote kit</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "biochemists_kit"
  },
  {
    "type": "artisan",
    "name": "Biotech’s implements",
    "html": "<p>Biotech’s implements include all of the necessary components to craft and install cybernetic augmentations in humanoids and beasts.</p>\n<p><strong>MEDICINE</strong>.\nCombined with biotech’s implements, your medical acumen allows you to better treat the injuries of cybernetically-enhanced patients.</p>\n<p><strong>INSIGHT</strong>.\nYour knowledge of cybernetics’ functionality grants you improved awareness of the facial ticks of the cybernetically-enhanced.</p>\n<p><strong>TECHNOLOGY</strong>.\nYour knowledge and experience lets you identify cybernetic augmentations, and their function.</p>\n<p><strong>ENHANCE</strong>.\nDuring a short or long rest, you can make a DC 15 Biotech’s Implements check to temporarily enhance a creature's cybernetics. On a success, the target gains a +1 bonus to an ability score of your choice for the next 24 hours.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Install a cybernetic augmentation</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Repair damaged cybernetics</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Analyze a cybernetic system</td>\n<td>25</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "biotechs_implements"
  },
  {
    "type": "artisan",
    "name": "Brewer's Supplies",
    "html": "<p>Brewing is the art of producing beer, mead, wine, and liquor. Not only does brewing create alcoholic beverages, but the\nprocess of brewing purifies water. Brewing beer, mead, or wine takes weeks of fermentation, but only a few hours of work.\nYou can further distill fermented beverages to create liquor.</p>\n<p><strong>History</strong>. Proficiency with brewer's supplies gives you additional insight on Intelligence (History) checks concerning\nevents that involve alcohol as a significant element.</p>\n<p><strong>Medicine</strong>. This tool proficiency grants additional insight when you treat anyone suffering from alcohol poisoning or\nwhen you can use alcohol to dull pain.</p>\n<p><strong>Persuasion</strong>. A stiff drink can help soften the hardest heart. Your proficiency with brewer's supplies can help you ply\nsomeone with drink, giving them just enough alcohol to mellow their mood.</p>\n<p><strong>Potable Water</strong>. Your knowledge of brewing enables you to purify water that would otherwise be undrinkable. As part of\na long rest, you can purify up to 25 liters (~6.5 gallons) water, or 5 liters (~1.5 gallons) as part of a short rest.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Detect poison or impurities in a drink</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Identify alcohol</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Ignore effects of alcohol</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "brewers-supplies"
  },
  {
    "type": "artisan",
    "name": "Brewer’s kit",
    "html": "<p>Brewer’s kit include includes all of the necessary components to ferment and store beer, as well as other alcoholic beverages.\nProficiency with this kit lets you add your proficiency bonus to any ability checks you make to create or identify alcoholic beverages.</p>\n<p><strong>LORE</strong>.\nProficiency with brewer’s kit gives you additional insight on Intelligence (Lore) checks concerning events that involve alcohol as a significant element.</p>\n<p><strong>MEDICINE</strong>.\nThis tool proficiency grants additional insight when you treat anyone suffering from alcohol poisoning or when you can use alcohol to dull pain.</p>\n<p><strong>PERSUASION</strong>.\nA stiff drink can help soften the hardest heart. Your proficiency with brewer’s kit can help you ply someone with drink, giving them just enough alcohol to mellow their mood .</p>\n<p><strong>BREWMASTER</strong>.\nOver the course of a short or long rest, you can make a DC 15 brewer’s kit check to hone or reduce the addictive properties of an alcoholic beverage within reach. To use this benefit, you must have a brewer’s kit, and the alcoholic beverage must be within reach. If a creature consumes the alcoholic beverage before the end of your next short or long rest, they have advantage or disadvantage (your choice) on the saving throws made to avoid the low and addiction.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Detect poison or impurities in a drink</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Identify alcohol</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Ignore effects of alcohol</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "brewers_kit"
  },
  {
    "type": "artisan",
    "name": "Chef’s kit",
    "html": "<p>This kit includes all of the necessary implements to prepare and serve food to up to six people. Proficiency with this kit lets you add your proficiency bonus to any ability checks you make to identify food. Also, proficiency with this kit is required to create field rations.</p>\n<p><strong>LORE</strong>.\nYour knowledge of cooking techniques allow you to assess the social patterns involved in a culture’s eating habits.</p>\n<p><strong>MEDICINE</strong>.\nWhen administering treatment, you can transform medicine that is bitter or sour into a pleasing concoction.</p>\n<p><strong>SURVIVAL</strong>.\nWhen foraging for food, you can make do with ingredients you scavenge that others would be unable to transform into nourishing meals.</p>\n<p><strong>PREPARE MEALS</strong>.\nAs part of a short rest, you can prepare a tasty meal that helps your companions regain their strength. You and up to five creatures of your choice regain 1 extra hit point per Hit Die spent during a short rest, provided you have access to your chef’s kit and sufficient food.\nDuring a long rest, you can prepare and serve a meal that helps you and your allies recover from the rigors of adventuring, provided you have suitable food, chef’s kit, and other supplies on hand. The meal serves up to six people, and each person who eats it regains two additional Hit Dice at the end of the long rest. In addition, those who partake of the meal have advantage on Constitution saving throws against disease for the next 24 hours.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Create a typical meal</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Spot poison or impurities in food</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Create a gourmet meal</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "chefs_kit"
  },
  {
    "type": "artisan",
    "name": "Chemists Supplies",
    "html": "",
    "id": "chemists-supplies"
  },
  {
    "type": "artisan",
    "name": "Constructor’s implements",
    "html": "<p>Constructor’s implements include all of the necessary components to build furnitures and structures.</p>\n<p><strong>LORE</strong>.\nThis tool proficiency aids you in identifying the use and the origin of buildings and structures.</p>\n<p><strong>INVESTIGATION/PERCEPTION</strong>.\nYou gain additional insight when inspecting areas within structures, because you know tricks of construction that can conceal areas from discovery.</p>\n<p><strong>TEMPORARY SHELTER</strong>.\nAs part of a long rest, you can construct a lean-to or a similar shelter to keep your group dry and in the shade for the duration of the rest. Because it was fashioned quickly from whatever wood was available, the shelter collapses 1d3 days after being assembled.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Chisel a small hole in a wall</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Design a complex structure</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Find a weak point in a wall</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Pry apart a door</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "constructors_implements"
  },
  {
    "type": "artisan",
    "name": "Cook's Utensils",
    "html": "<p>With a cook in your party, your meals will be much better than the typical mix of nutrient bars and protein soup.</p>\n<p><strong>History</strong>. Your knowledge of cooking techniques allows you to assess the social patterns involved in a culture's eating habits.</p>\n<p><strong>Medicine</strong>. When administering treatment, you can transform medicine that is bitter or sour into a pleasing concoction.</p>\n<p><strong>Survival</strong>. When foraging for food, you can make do with ingredients you scavenge that others would be unable to transform\ninto nourishing meals.</p>\n<p><strong>Prepare Meals</strong>. As part of a short rest, you can prepare a tasty meal that helps your companions regain their strength.\nYou and up to five creatures of your choice regain 1 extra hit point per Hit Die spent during a short rest, provided you have\naccess to your cook's utensils and low-grade provisions. If you use mid-grade provisions, gain 2 extra hit points per Hit Die\nspent. And if you use high-grade provisions, gain 3 extra hit points per Hit Die spent.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Create a typical meal</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Duplicate a meal</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Spot poison or impurities in food</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Create a gourmet meal</td>\n<td>15---</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "cooks-utensils"
  },
  {
    "type": "artisan",
    "name": "Cybertech’s implements",
    "html": "<p>Cybertech’s implements include all of the necessary components to modify and maintain datacrons and wristpads.</p>\n<p><strong>LORE</strong>.\nYour knowledge allows you greater insight into the history and origin of datacrons.</p>\n<p><strong>INVESTIGATION</strong>.\nYour use of tools allows you to more accurately discern illusions within 5 feet of you for what they are.</p>\n<p><strong>TECHNOLOGY</strong>.\nYour expertise grants you greater insight into the enhanced properties of wristpads.</p>\n<p><strong>Data Analysis</strong>.\nDuring a short or long rest, you can make a DC 15 Cybertech’s Implements check to analyze data from a cyber device. On a success, you can extract useful information or enhance the device's performance for the next 24 hours.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Unlock a datacron</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Disassemble a wristpad</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "cybertechs_implements"
  },
  {
    "type": "artisan",
    "name": "Demolitions kit",
    "html": "<p>Demolitions kits includes all of the necessary components to create, set, and disarm explosives. It contains a plastic face guard and heavy duty gloves, as well as precision cutting and gripping tools, and various common components of grenades and mines.</p>\n<p><strong>LORE</strong>.\nYour knowledge of explosives grants you insight when answering questions about the most effective explosives for a given task.</p>\n<p><strong>INVESTIGATION AND PERCEPTION</strong>.\nYou gain additional insight when looking for mines and charges, because you have learned a variety of common signs that betray their presence.</p>\n<p><strong>AMPLIFY EXPLOSIVE</strong>.\nOver the course of a short or long rest, you can make a DC 15 demolitions kit check to temporarily improve one grenade or mine. To use this benefit, you must have a demolitions kit with you, and the object must be within reach. If the explosive is detonated before the end of your next short or long rest, it deals bonus damage. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Conceal an explosive</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table><p>Disarm a mine\tVaries</p>\n",
    "id": "demolitions_kit"
  },
  {
    "type": false,
    "name": "Disguise Kit",
    "html": "<p>The perfect tool for anyone who wants to engage in trickery, a disguise kit enables its owner to adopt a false identity.</p>\n<p><strong>Deception</strong>. In certain cases, a disguise can improve your ability to weave convincing lies.</p>\n<p><strong>Intimidation</strong>. The right disguise can make you look more fearsome.</p>\n<p><strong>Performance</strong>. A cunning disguise can enhance an audience's enjoyment of a performance, provided the disguise is properly\ndesigned to evoke the desired reaction.</p>\n<p><strong>Persuasion</strong>. People tend to trust a person in uniform. If you disguise yourself as an authority figure, your efforts\nto persuade others are often more effective.</p>\n<p><strong>Create Disguise</strong>. As part of a long rest, you can use 1 omni-gel to create a disguise. It takes you 1 minute to don such a disguise once you have created it.\nYou can carry only one such disguise on you at a time without drawing undue attention, unless you have something to keep them hidden.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Cover injuries or distinguishing marks</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Spot a disguise being used by someone else</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Copy a humanoid's appearance</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "disguise-kit"
  },
  {
    "type": "artisan",
    "name": "Disguise kit",
    "html": "<p>Disguise kits includes all of the necessary components to create and apply a disguise. It includes cosmetics, hair dye, and small props that let you create disguises that change your physical appearance, in addition to a tool that lets them holographically mimic clothing.</p>\n<p><strong>DECEPTION</strong>.\nIn certain cases, a disguise can improve your ability to weave convincing lies.</p>\n<p><strong>INTIMIDATION</strong>.\nThe right disguise can make you look more fearsome, whether you want to scare someone away by posing as a plague victim or intimidate a gang of thugs by taking the appearance of a bully.</p>\n<p><strong>PERSUASION</strong>.\nFolk tend to trust a person in uniform. If you disguise yourself as an authority figure, your efforts to persuade others are often more effective.</p>\n<p><strong>CREATE DISGUISE</strong>.\nOver the course of a short or long rest, you can make a DC 15 disguise kit check to craft a disguise that mimics the appearance of a creature you spent at least 1 hour observing. To use this benefit, you must have a disguise kit with you. On a success, you can don or doff this disguise as an action. Additionally, once before your next short or long rest, you can gain a bonus to one check to pass yourself off as that creature. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Cover injuries or distinguishing marks</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Spot a disguise being used by someone else</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "disguise_kit"
  },
  {
    "type": "artisan",
    "name": "Forgery kit",
    "html": "<p>A forgery kit includes all of the necessary components to craft and identify forged documents, including copying a person’s seal or signature.</p>\n<p><strong>DECEPTION</strong>.\nA well-crafted forgery, such as papers proclaiming you to be a noble or a writ that grants you safe passage, can lend credence to a lie.</p>\n<p><strong>LORE</strong>.\nA forgery kit combined with your knowledge of history improves your ability to create fake historical documents or to tell if an old document is authentic.</p>\n<p><strong>INVESTIGATION</strong>.\nWhen you examine objects, proficiency with a forgery kit is useful for determining how an object was made and whether it is genuine.</p>\n<p><strong>QUICK FAKE</strong>.\nAs a part of a short rest, you can produce a forged document no more than one page in length. As a part of a long rest, you can produce a document that is up to four pages long. Your Intelligence check using a forgery kit determines the DC for someone else’s Intelligence (Investigation) check to spot the fake.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mimic handwriting</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Duplicate a seal</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "forgery_kit"
  },
  {
    "type": "artisan",
    "name": "Gadgeteer’s implements",
    "html": "<p>Gadgeteer's implements include all the necessary tools to create, repair, and modify mechanical devices and small contraptions. This kit is essential for inventors and tinkerers who love to experiment with various gadgets.</p>\n<p><strong>INVESTIGATION</strong>.\nIdentify the purpose and mechanism of unfamiliar gadgets more quickly.</p>\n<p><strong>LORE</strong>.\nYou can determine the age and origin of objects, even if you have only a few pieces remaining from the original.</p>\n<p><strong>SLIGHT OF HAND</strong>.\nUse your nimble fingers to assemble or disassemble delicate mechanisms without damaging them.</p>\n<p><strong>Quick Fix</strong>.\nDuring a short or long rest, you can make a DC 15 Gadgeteer’s Implements check to temporarily enhance a gadget. On a success, the gadget gains a +1 bonus to its functionality or an additional use for the next 24 hours. Each individual item may only be enhanced in this way once.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Identify the mechanism of a gadget</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Repair a malfunctioning device</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Create a new gadget from spare parts</td>\n<td>25</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "gadgeteers_implements"
  },
  {
    "type": false,
    "name": "Gaming Set",
    "html": "<p>Proficiency with a gaming set applies to one type of game, such as Skyllian-5 or games of chance that use dice.</p>\n<p><strong>History</strong>. Your mastery of a game includes knowledge of its history, as well as of important events it was connected\nto or prominent historical figures involved with it.</p>\n<p><strong>Insight</strong>. Playing games with someone is a good way to gain an understanding of their personality, granting you a better\nability to discern their lies from their truths and read their mood.</p>\n<p><strong>Sleight of Hand</strong>. Sleight of Hand is a useful skill for cheating at a game, as it allows you to swap pieces, palm cards,\nor alter a die roll. Alternatively, engrossing a target in a game by manipulating the components with dexterous\nmovements is a great distraction for a pickpocketing attempt.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Catch a player cheating</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Gain insight into an opponent's personality</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table><hr>\n",
    "id": "gaming-set"
  },
  {
    "type": "artisan",
    "name": "Gaming set",
    "html": "<p>A gaming set has all the pieces needed to play a specific game or type of game, such as pazaak or sabacc.</p>\n<p><strong>LORE</strong>.\nYour mastery of a game includes knowledge of its history, as well as of important events it was connected to or prominent historical figures involved with it.</p>\n<p><strong>INSIGHT</strong>.\nPlaying games with someone is a good way to gain understanding of their personality, granting you a better ability to discern their lies from their truths and read their mood.</p>\n<p><strong>SLEIGHT OF HAND</strong>.\nSleight of Hand is a useful skill for cheating at a game, as it allows you to swap pieces, palm cards, or alter a die roll. Alternatively, engrossing a target in a game by manipulating the components with dexterous movements is a great distraction for a pickpocketing attempt.</p>\n<p><strong>Master Strategist</strong>.\nDuring a short or long rest, you can make a DC 15 Gaming Set check to devise a new strategy or game plan. On a success, you gain advantage on your next skill check related to the game. The game must be from your Gaming Set or sufficiently related to it.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Catch a player cheating</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Gain insight into an opponent’s personality</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Entertain a crowd with a game</td>\n<td>10</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "gaming_set"
  },
  {
    "type": "artisan",
    "name": "Geneticist’s implements",
    "html": "<p>Geneticist’s implements include all the necessary components to analyze genetic material and perform genetic modifications. This kit is vital for those who study and manipulate biological traits.</p>\n<p><strong>Medicine</strong>.\nGain insights into genetic diseases and their treatments.</p>\n<p><strong>Nature</strong>.\nUnderstand the genetic makeup of various creatures and plants.</p>\n<p><strong>Lore</strong>.\nIdentify and understand the historical and cultural implications of genetic traits and modifications.</p>\n<p><strong>Genetic Modification</strong>.\nDuring a short or long rest, you can make a DC 15 Geneticist’s Implements check to temporarily enhance a creature's abilities. On a success, the target gains a +1 bonus to an ability score of your choice for the next 24 hours. If you have expertise in this tool, the target gains a +2 instead.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Analyze a genetic sample</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Identify genetic diseases</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Modify the genes of a small creature</td>\n<td>25</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "geneticists_implements"
  },
  {
    "type": false,
    "name": "Hacking Tools",
    "html": "<p>Hacking tools are used to override security systems in order to gain access to encrypted files, open locked doors, or\nsabotage security devices such as cameras, turrets, or mechs. Proficiency with the tools also grants you a general knowledge\nof VIs, encryption techniques, and cryptography.</p>\n<p><strong>Perception</strong>. You're understanding of patterns and cryptography gives you insight when discerning information from unknown languages.</p>\n<p><strong>Investigation</strong>. You gain additional insight when utilizing networked systems (such as the exonet) to find information.</p>\n<p><strong>Fortify</strong>. Just as you can break down security, you can also fortify it. For each hour of work,\nyou can further encrypt an electronic data package, rebuff a security device, or harden a network to attack, increasing\nthe DC to hack it by 1 (maximum 5).</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Disable a security system</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Decrypt a data package</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Falsify electronic documents</td>\n<td>Varies</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "hacking-tools"
  },
  {
    "type": "artisan",
    "name": "Jeweler’s implements",
    "html": "<p>Jeweler’s implements include all of the necessary components to identify and refine gemstones.</p>\n<p><strong>LORE</strong>.\nProficiency with jeweler’s implements grants you knowledge about the reputed mystical uses of gems. This insight proves handy when you make Lore checks related to gems or gem-encrusted items.</p>\n<p><strong>INVESTIGATION</strong>.\nWhen you inspect jeweled objects, your proficiency with jeweler’s implements aids you in picking out clues they might hold.</p>\n<p><strong>TECHNOLOGY</strong>.\nYour combined experience lets you refine gemstones for use with greater efficiency.</p>\n<p><strong>Jewelry Crafting</strong>.\nDuring a short or long rest, you can make a DC 15 Jeweler’s Implements check to craft a piece of jewelry. On a success, you create a piece of jewelry that provides a +1 bonus to Charisma (Persuasion) checks when worn for the next 24 hours.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Modify a gem’s appearance</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Determine a gem’s history</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "jewelers_implements"
  },
  {
    "type": "artisan",
    "name": "Mechanic’s kit",
    "html": "<p>This kit contains all of the commonly required tools to make repairs on constructs, such as ships, speeders, and turrets. Proficiency with this kit lets you add your proficiency bonus to any ability checks you make to perform repairs or install ship upgrades.</p>\n<p><strong>LORE</strong>.\nYour skill allows you to more readily discern the make and model of vehicle and ship parts.</p>\n<p><strong>INVESTIGATION</strong>.\nYour experience lets you more readily identify aftermarket modifications in vehicles and ships.</p>\n<p><strong>TECHNOLOGY</strong>.\nYour experience grants you greater insight when conducting repairs on ships or vehicles.</p>\n<p><strong>QUICK FIXER</strong>.\nWhen you are interrupted while you are conducting repairs on a vehicle or ship, reduce the required time by half as long as you are present during the entirety of the repairs.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Restoring power to a damaged vehicle</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Disassembling a vehicle’s engine</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "mechanics_kit"
  },
  {
    "type": false,
    "name": "Medical Kit",
    "html": "<p>Medical Kits contain the necessary tools and supplies to triage injuries and treat diseases.</p>\n<p><strong>Insight</strong>. When you spend 1 minute observing an organic creature, you gain additional insight on if the creature is injured or weakened.</p>\n<p><strong>Investigation</strong>. When you investigate a dead organic creature, you gain insight into what caused its death and how long ago it died.</p>\n<p><strong>Medicine</strong>. You can spend a medi-gel to gain advantage when stabilizing a creature.</p>\n<p><strong>Healing Hands</strong>. During a short rest, you can clean and bind the wounds of up to six willing beasts and humanoids.\nEach creature that spends a Hit Die during this rest can forgo the roll and instead regain the maximum number of hit points the die can restore.\nA creature can do so only once per rest, regardless of how many Hit Dice it spends.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Close a wound</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Diagnose a sickness</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Craft a medicine to treat a disease</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table><hr>\n",
    "id": "medical-kit"
  },
  {
    "type": "artisan",
    "name": "Munitions kit",
    "html": "<p>This kit contains the necessary tools to create ammunition for blasters, as well as devices to hone lightweapons and vibroweapons.</p>\n<p><strong>History</strong>. Your expertise lends you additional insight when examining weapons.</p>\n<p><strong>Investigation</strong>. You can spot clues and make deductions that others might overlook when an investigation involves weapons.</p>\n<p><strong>SLEIGHT OF HAND</strong>.\nPrecisely assemble and disassemble delicate or explosive components.</p>\n<p><strong>HONE WEAPON</strong>.\nOver the course of a short or long rest, you can make a DC 15 munitions kit check to temporarily improve a blaster or vibroweapon. To use this benefit, you must have munitions kit with you, and the object must be within reach. On a success, once before your next short or long rest, a character wielding this weapon can gain a bonus to one weapon damage roll. This bonus is a die, with a maximum value equal to your proficiency bonus. If you have expertise in the tool, this die’s maximum is instead equal to twice your proficiency bonus.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Mimic handwriting</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Duplicate a seal</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "munitions_kit"
  },
  {
    "type": false,
    "name": "Musical Instrument",
    "choices": [
      {
        "clarinet": "Clarinet"
      },
      {
        "saxaphone": "Saxaphone"
      },
      {
        "guitar": "Guitar"
      },
      {
        "xylophone": "Xylophone"
      },
      {
        "bongos": "Bongo Drums"
      }
    ],
    "html": "<p>Proficiency with a musical instrument indicates you are familiar with the techniques used to play it. You also have\nknowledge of some songs commonly performed with that instrument.</p>\n<p><strong>History</strong>. Your expertise aids you in recalling lore related to your instrument.</p>\n<p><strong>Performance</strong>. Your ability to put on a good show is improved when you incorporate an instrument into your act.</p>\n<p><strong>Compose a Tune</strong>. As part of a long rest, you can compose a new tune and lyrics for your instrument.</p>\n<p><strong>Distracting Performance</strong>. While performing with your instrument, you can try to distract one sentient creature\nyou can see who can see and hear you. Make a Charisma (Performance) check with your instrument contested by the humanoid's Wisdom (Insight)\ncheck. If your check succeeds, you grab the creature's attention enough that it makes Wisdom (Perception) and\nIntelligence (Investigation) checks with disadvantage until you stop performing.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Identify a tune</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Improvise a tune</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "musical-instrument"
  },
  {
    "type": "artisan",
    "name": "Musical instrument",
    "html": "<p><strong>MUSICAL INSTRUMENTS</strong>.\nA musical instrument includes all of the necessary components to play it, as well as a few songs commonly performed with that instrument.</p>\n<p><strong>LORE</strong>.\nYour expertise aids you in recalling lore related to your instrument.</p>\n<p><strong>PERFORMANCE</strong>.\nYour ability to put on a good show is improved when you incorporate an instrument into your act.\nSKILL 3\nSkill and tool description interaction.</p>\n<p><strong>Distracting Performance</strong>.\nWhile performing with your instrument, you can try to distract one sentient creature you can see who can see and hear you. Make a Charisma (Performance) check with your instrument contested by the humanoid's Wisdom (Insight) check. If your check succeeds, you grab the creature's attention enough that it makes Wisdom (Perception) and Intelligence (Investigation) checks with disadvantage until you stop performing.</p>\n<p><strong>Inspiring Melody</strong>.\nDuring a short or long rest, you can make a DC 15 Musical Instrument check to play an inspiring melody. On a success, allies who hear the performance gain a +1 bonus to their next skill check or saving throw within the next 24 hours.</p>\n<p><strong>Sample Activities</strong></p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Identify a tune</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Subtly manipulate the emotions of your audience</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Improvise a tune</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "musical_instrument"
  },
  {
    "type": false,
    "name": "Painter's Supplies",
    "html": "<p>Proficiency with painter's supplies represents your ability to paint and draw, design decals and paint jobs for armor and vehicles,\nand create propaganda. You also acquire an understanding of art history, which can aid you in examining works of art.</p>\n<p><strong>Insight</strong>. Your expertise allows you to glimpse the emotional states of other artists by viewing their works of art.</p>\n<p><strong>Investigation, Perception</strong>. When you inspect a painting or a similar work of visual art,\nyour knowledge of the practices behind creating it can grant you additional insight.</p>\n<p><strong>Painting and Drawing</strong>.\nAs part of a short or long rest, you can produce a simple work of art or a design for a suit of armor or vehicle. Although\nyour work might lack precision, you can capture an image or a scene, or make a quick copy of a piece of art you saw.</p>\n<p><strong>Detailing</strong>.\nWith 8 hours of work, you can detail a suit of armor. With 20 hours of work, you can detail a vehicle.\nThe detailing can provide advantages to skill checks made by the wearer of the armor or user of the vehicle, such\nas a bonus to a stealth check for camouflage designs.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Paint an accurate portrait</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Create a painting with a hidden message</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table><hr>\n",
    "id": "painters-supplies"
  },
  {
    "type": "artisan",
    "name": "Poisoner’s kit",
    "html": "<p>A poisoner’s kit includes all of the necessary components to craft and store poisons.</p>\n<p><strong>INVESTIGATION</strong>.\nYour knowledge of poisons has taught you to handle those substances carefully, giving you an edge when you inspect poisoned objects or try to extract clues from events that involve poison.</p>\n<p><strong>MEDICINE</strong>.\nWhen you treat the victim of a poison, your knowledge grants you added insight into how to provide the best care to your patient.</p>\n<p><strong>NATURE</strong>.\nWorking with poisons enables you to acquire lore about which plants and animals are poisonous.</p>\n<p><strong>FEATURE</strong>.\nOver the course of a short or long rest, you can make a DC 15 poisoner’s kit check to temporarily improve the potency of one dose of poison. To use this benefit, you must have a poisoner’s kit, and the poison must be within reach. If the poison is applied before the end of your next short or long rest, its DC becomes 8 + your proficiency bonus + your Intelligence modifier, and it deals extra poison damage equal to your Intelligence modifier.\nAdditionally, you can improve the capability of one dose of poison. To use this benefit, you must have a poisoner - s kit, and the poison must be within reach. If the poison is applied before the end of your next short or long rest, the target has disadvantage on the saving throw made to resist your poison. Once you’ve used this feature, you must complete a long rest before you can use it again.</p>\n<p><strong>Sample Activities</strong></p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Spot a poisoned object</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Determine the effects of poison</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "poisoners_kit"
  },
  {
    "type": "artisan",
    "name": "Scavenging kit",
    "html": "<p>A scavenging kit includes the necessary implements to harvest and scavenge valuable materials from the environment, such as ores, metals, and other resources. This kit is perfect for those who rely on finding and repurposing materials.</p>\n<p><strong>Survival</strong>.\nLocate and extract valuable materials in the wild.</p>\n<p><strong>Perception</strong>.\nSpot valuable resources that others might overlook.</p>\n<p><strong>Nature</strong>.\nUnderstand the properties and potential uses of found materials.</p>\n<p><strong>Material Extraction</strong>.\nDuring a short or long rest, you can make a DC 15 Scavenging Kit check to extract valuable materials from the environment. On a success, you gain enough materials to craft a basic item or enhance an existing one.</p>\n<p><strong>Sample Activities</strong></p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Identify valuable materials</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Harvest resources from the environment</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Repurpose materials into crafting components</td>\n<td>25</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "scavenging_kit"
  },
  {
    "type": "artisan",
    "name": "Security kit",
    "html": "<p>A security kit include all of the necessary components to set or disarm locks and traps.</p>\n<p><strong>LORE</strong>.\nYour knowledge of traps grants you insight when answering questions about locations that are renowned for their traps.</p>\n<p><strong>INVESTIGATION AND PERCEPTION</strong>.\nYou gain additional insight when looking for traps, because you have learned a variety of common signs that betray their presence.</p>\n<p><strong>SET A TRAP</strong>.\nJust as you can disable traps, you can also set them. As part of a short rest, you can create a trap using items you have on hand. The total of your check becomes the DC for someone else’s attempt to discover or disable the trap. The trap deals damage appropriate to the materials used in crafting it (such as poison or a weapon) or damage equal to half the total of your check, whichever the DM deems appropriate.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Pick a moderate lock</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table><p>Disable a trap\tVaries</p>\n",
    "id": "security_kit"
  },
  {
    "type": "artisan",
    "name": "Slicer’s kit",
    "html": "<p>A slicer’s kit includes all of the necessary components to interface with and disarm digital securities.</p>\n<p><strong>LORE</strong>.\nYour knowledge of digital securities grants you insight when answering questions about them.</p>\n<p><strong>INVESTIGATION</strong>.\nYou gain additional insight when looking for digital securities when using computers and terminals.</p>\n<p><strong>TECHNOLOGY</strong>.\nYour knowledge of common digital security types makes it easier for you to identify them.</p>\n<p><strong>Security Breach</strong>.\nDuring a short or long rest, you can make a DC 15 Slicer’s Kit check to hack into a secure system. On a success, you gain access to restricted information or control over the system for the next 24 hours.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Identify a hidden security routine</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Reprogram a security routine</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "slicers_kit"
  },
  {
    "type": "artisan",
    "name": "Spicer’s kit",
    "html": "<p>Spicer’s kit include all of the necessary components to refine and create illicit substances.</p>\n<p><strong>Medicine</strong>.\nIdentify and utilize medicinal substances that can be used for illicit drugs or to mimic their effects</p>\n<p><strong>Nature</strong>.\nIdentify the ingredients and properties of illicit dryugs</p>\n<p><strong>Deception</strong>.\nUse your knowledge of spices to create convincing replicas of other substances.</p>\n<p><strong>SLYTHMONGER</strong>.\nOver the course of a short or long rest, you can make a DC 15 spicer’s kit check to temporarily hone or reduce the addictive properties of a spice within reach. To use this benefit, you must have a spicer’s kit, and the spice must be within reach. If a creature consumes the spice before the end of your next short or long rest, they have advantage or disadvantage (your choice) on the saving throws made to avoid the low and addiction.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Create a potion to reduce side effects of drugs</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Identify properties of harmful substances</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Refine raw ingredients into a useful or recreational substance</td>\n<td>25</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "spicers_kit"
  },
  {
    "type": false,
    "name": "starship system",
    "html": "",
    "id": "starship-system-drive"
  },
  {
    "type": "starship",
    "name": "EWS",
    "html": "",
    "id": "starship-system-ews"
  },
  {
    "type": "starship",
    "name": "Starship Systems- Helm",
    "html": "",
    "id": "starship-system-helm"
  },
  {
    "type": "starship",
    "name": "Starship Systems- Navigation",
    "html": "",
    "id": "starship-system-navigation"
  },
  {
    "type": "starship",
    "name": "Starship Systems- SSC",
    "html": "",
    "id": "starship-system-ssc"
  },
  {
    "type": "starship",
    "name": "Starship Systems- Weapons",
    "html": "",
    "id": "starship-system-weapons"
  },
  {
    "type": "artisan",
    "name": "Surveyor’s implements",
    "html": "<p>Surveyor’s implements include all of the necessary components to draw and store maps.</p>\n<p><strong>LORE</strong>.\nYou can use your knowledge of maps and locations to unearth more detailed information. For instance, you might spot hidden messages in a map, identify when the map was made to determine if geographical features have changed since then, and so forth.</p>\n<p><strong>NATURE</strong>.\nYour familiarity with physical geography makes it easier for you to answer questions or solve issues relating to the terrain around you.</p>\n<p><strong>SURVIVAL</strong>.\nYour understand of geography makes it easier to find paths to civilization, to predict reas where towns might be found, and to avoid becoming lost. You have studied so many maps that common patterns, such as how trade routes evolve and where settlements arise in relation to gegraphic locations, are familiar to you.</p>\n<p><strong>Mapmaking</strong>.\nDuring a short or long rest, you can make a DC 15 Surveyor’s Implements check to create an accurate map of the area. On a success, the map provides a +1 bonus to navigation-related skill checks for the next 24 hours.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Determine a map’s age and origin</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Estimate direction and distance to a landmark</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Discern that a map is fake</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Fill in a missing part of a map</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "surveyors_implements"
  },
  {
    "type": "artisan",
    "name": "Synthweaver’s implements",
    "html": "<p>Synthweaver’s implements include all of the necessary components to craft and repair clothing and boots.</p>\n<p><strong>LORE</strong>.\nYour expertise lends you additional insight when examining clothes and boots.</p>\n<p><strong>INVESTIGATION</strong>.\nUsing your knowledge of the process of creating cloth objects, you can spot clues and make deductions that others would overlook when you examine tapestries, upholstery, clothing, and other woven items, or examining the wear of clothing and boots.</p>\n<p><strong>SLEIGHT OF HAND</strong>.\nHandle delicate fabrics and intricate weaving techniques with precision.<strong>HIDDEN COMPARTMENT</strong>\nOver the course of a short or long rest, you can make a DC 15 synthweaver’s implements check to add a hidden compartment to a pair of boots or an article of clothing. The compartment can hold an object up to 3 inches long and 1 inch wide and deep. The DC to find the hidden compartment is equal to 8 + your bonus to checks with synthweaver’s implements at the time of creation.</p>\n<p>Sample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Repurpose or mend a cloth</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Tailor an outfit</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Find a hidden compartment in clothing</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "synthweavers_implements"
  },
  {
    "type": "artisan",
    "name": "Tailor's Tools",
    "html": "",
    "id": "tailors-tools"
  },
  {
    "type": false,
    "name": "Thieves' tools",
    "html": "<p>Thieves' tools are used to <em>manually</em> disarm traps, breach security doors, and open locked containers. Criminals prefer thieves'\ntools over hacking tools because they're cheaper and more reliable. For most, trying to outsmart a security VI can be near impossible,\nbut snipping a few wires is easy if you know the right ones to cut. Proficiency with the tools also grants you a general knowledge\nof traps, security systems, and locks.</p>\n<p><strong>History</strong>. Your knowledge of security systems grants you insight when answering questions about locations that are renowned for their\nsecurity.</p>\n<p><strong>Investigation and Perception</strong>. You gain additional insight when looking for traps and alarms because you have learned a variety of\ncommon signs that betray their presence.</p>\n<p><strong>Set a trap</strong>. Just as you can disable traps, you can also set them. As part of a short rest, you can use 1 create a trap\nusing 1 omni-gel and any other items you have on hand. The total of your check becomes the DC for someone else's attempt to discover\nor disable the trap. The trap deals damage appropriate to the materials used in crafting it (such as poison or a weapon)\nor damage equal to half the total of your check, whichever the GM deems appropriate.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Pick a lock</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Disable alarm</td>\n<td>Varies</td>\n</tr>\n<tr>\n<td>Disable a trap</td>\n<td>Varies</td>\n</tr>\n</tbody>\n</template></v-simple-table><hr>\n",
    "id": "thieves-tools"
  },
  {
    "type": false,
    "name": "Tinker's Tools",
    "html": "<p>A set of tinker's tools is designed to create small, inventive devices from omni-gel. Some examples include a motion sensor,\na desalinator, a compass, a light source, or a small EMP device.</p>\n<p><strong>History</strong>. You can determine the age and origin of objects, even if you have only a few pieces remaining from the original.</p>\n<p><strong>Investigation</strong>. When you inspect a damaged object, you gain knowledge of how it was damaged and how long ago.</p>\n<p><strong>Mending</strong>. For 1 omni-gel, you can repair a single break or tear in an object, such as a punctured tire, a cracked helmet, or a ripped pack.\nAs long as the break or tear is no larger than 30 cm (~ 1 foot) in any dimension, you mend it, leaving no trace of the former damage.</p>\n<p><strong>Repair</strong>. You can restore 10 hit points to a damaged object for 1 omni-gel and an hour of work.</p>\n<p><strong>Craft Armor or Weapon Mod</strong>. See the <nuxt-link to=\"/manual/missions#between-missions\">crafting</nuxt-link> section\nof downtime activities for more information.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Temporarily repair a disabled device</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Repair an item in half the time</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Improvise a temporary item using scraps</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "tinkers-tools"
  },
  {
    "type": "artisan",
    "name": "Tinker’s implements",
    "html": "<p>Tinker’s implements include all of the necessary components to craft and repair augments and minor trinkets.</p>\n<p><strong>LORE</strong>.\nYou can determine the age and origin of objects, even if you have only a few pieces remaining from the original.</p>\n<p><strong>INVESTIGATION/PERCEPTION</strong>.\nYou are more effective at identifying traps concealed by debris.</p>\n<p><strong>SLEIGHT OF HAND</strong>.\nYou are more effective at hiding traps that you place.</p>\n<p><strong>MULTITOOL</strong>.\nYou can use tinker’s implements as other tools with which you are proficient. You still make the ability check with the other tool, but you do not require a physical set of the other tools. If you have expertise in the other tools, you must also have expertise in tinker’s implements to gain the benefit of that expertise when using tinker’s implements in this way.</p>\n<p><strong>REPAIR TRINKETS</strong>\nWith access to your tools, you can repair small items. For any object, you need access to raw materials required to repair it.\nSample Activities</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Temporarily repair a disabled device</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Repair an item in half the time</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Improvise an item using scraps</td>\n<td>20</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "tinkers_implements"
  },
  {
    "type": false,
    "name": "TRAPPER’S KIT",
    "html": "<p>A trapper’s kit includes all the necessary components to create, set, and disarm traps. This kit is vital for hunters, scouts, and those who need to protect an area with hidden snares and pitfalls.</p>\n<p><strong>Survival</strong>. You can determine the age and origin of objects, even if you have only a few pieces remaining from the original.</p>\n<p><strong>Stealth:</strong>. When you inspect a damaged object, you gain knowledge of how it was damaged and how long ago.</p>\n<p><strong>Investigation</strong>. For 1 omni-gel, you can repair a single break or tear in an object, such as a punctured tire, a cracked helmet, or a ripped pack.\nAs long as the break or tear is no larger than 30 cm (~ 1 foot) in any dimension, you mend it, leaving no trace of the former damage.</p>\n<p><strong>Trap Mastery</strong>. During a short or long rest, you can make a DC 15 Trapper’s Kit check to set a sophisticated trap. On a success, the trap has a +1 bonus to its DC to be detected or disarmed for the next 24 hours.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Set a basic snare trap</td>\n<td>10</td>\n</tr>\n<tr>\n<td>Disarm a complex trap</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Conceal a pitfall</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "trappers_kit"
  },
  {
    "name": "Vehicles",
    "html": "<p>Proficiency with a vehicle applies to one type of environment. The proficiency reflects the ability to navigate and maneuver\nwithin the environment and is not limited to a specific vehicle. For example, a hovercraft could be a land or water vehicle.</p>\n<me-tpg e=\"div\" s=\"h3\">Vehicle Types</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><ul>\n<li><strong>Land</strong>: travel over solid surfaces</li>\n<li><strong>Water</strong>: travel on or through liquids</li>\n<li><strong>Air</strong>: travel <em>within</em> a planet's atmosphere</li>\n<li><strong>Space</strong>: travel in space, limited to small ships meant to travel short distances, like fighters and transports</li>\n</ul>\n<p><strong>Engineering</strong>. Vehicle proficiency combined with knowledge of engineering improves your ability to repair, maintain,\nor assess vehicles of that type.</p>\n<p><strong>Insight</strong>. Your knowledge about vehicles of this type makes it easy to discern the veracity of others' boasts about their piloting\nskills and past stunts.</p>\n<p><strong>Investigation</strong>. You gain insight into the environment's conditions and the safety of traveling within the conditions.</p>\n<p><strong>Pilot's Luck</strong>. If your vehicle crashes while you are driving it, you and your passengers take half damage from the crash.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Drive the vehicle through difficult conditions</td>\n<td>varies</td>\n</tr>\n<tr>\n<td>Make a complicated maneuver</td>\n<td>varies</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "vehicles"
  },
  {
    "type": false,
    "name": "Weaponsmith's Workbench",
    "html": "<p>A weaponsmith's workbench allows you to customize, craft, and repair weapons.</p>\n<p><strong>History</strong>. Your expertise lends you additional insight when examining weapons.</p>\n<p><strong>Investigation</strong>. You can spot clues and make deductions that others might overlook when an investigation involves weapons.</p>\n<me-tpg e=\"div\" s=\"h3\">Activities</me-tpg><me-hr size=\"1\" class=\"mb-2\"/><p>With access to your workbench, you can perform one of the following activities as part of a long rest.</p>\n<ul>\n<li><strong>Install mod</strong>. Install a weapon mod to a weapon.</li>\n<li><strong>Repair weapon</strong>. Repair a used weapon to a pristine condition. Repaired weapons can be sold for one half their market value.</li>\n<li><strong>Craft weapon</strong>. See the <nuxt-link to=\"/manual/missions#between-missions\">crafting</nuxt-link> section of downtime activities for more information.</li>\n<li><strong>Salvage a weapon mod</strong>. DC 20. On a success, you can salvage 1 weapon mod from a weapon. On a failure, the weapon\nand all mods are destroyed.</li>\n<li><strong>Customize a weapon</strong>. Customize a weapon, consuming 10 omni-gel and applying one of the following improvements.\nA customized weapon becomes Special and any installed mods are removed.\n<ul>\n<li>2 additional heat</li>\n<li>increase normal range by 50%</li>\n<li>+1 damage</li>\n<li>+1 to hit on attack rolls</li>\n</ul>\n</li>\n</ul>\n",
    "id": "weaponsmiths-workbench"
  },
  {
    "type": false,
    "name": "Writer’s Implements",
    "html": "<p>A set of tinker's tools is designed to create small, inventive devices from omni-gel. Some examples include a motion sensor,\na desalinator, a compass, a light source, or a small EMP device.</p>\n<p><strong>History</strong>. Accurately document events and understand historical contexts.</p>\n<p><strong>Performance</strong>. Write engaging and persuasive texts, from letters to stories.</p>\n<p><strong>Deception</strong>. Craft forgeries or misleading documents that can fool others.</p>\n<p><strong>PUBLISH OR PERISH</strong>\nOver the course of a short or long rest, you can make a DC 15 writer’s implements check to create an instruction manual for a skill or tool in which you are proficient. To use this benefit, you must have writer’s implements and a source on which to scribe your instruction. On a success, once before your next short or long rest, a creature with an Intelligence score of 6 or higher can spend 10 minutes reading your manual, after which they gain proficiency in the chosen skill or tool. This benefit lasts until you or the creature complete a short or long rest.</p>\n<v-simple-table class=\"mb-8\"><template v-slot:default><thead>\n<tr>\n<th>Activity</th>\n<th>DC</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Draft a detailed historical account</td>\n<td>15</td>\n</tr>\n<tr>\n<td>Forge a convincing document</td>\n<td>20</td>\n</tr>\n<tr>\n<td>Compose a persuasive letter</td>\n<td>15</td>\n</tr>\n</tbody>\n</template></v-simple-table>",
    "id": "writers_implements"
  }
]